{
    "breakingChanges": true,
    "breakingChangesNotes": "## Breaking Changes\n\n### 1. Removed Default Closure Codes for Problem and Change Request Ticket Types\n\n**Previous Behavior:**\n- The integration automatically applied default closure codes when updating Problem and Change Request tickets to closed states.\n\n**New Behavior:**\n- Default closure codes are no longer automatically applied for Problem and Change Request ticket types.\n- Users must explicitly provide closure codes when closing these ticket types.\n\n**Reason:**\n- ServiceNow API validation failures occurred when using the previous default closure codes for these ticket types.\n\n**Impact:**\n- Workflows that relied on automatic closure code assignment for Problem and Change Request tickets will need to be updated to explicitly provide closure codes.\n\n---\n\n### 2. Removed Automatic State Translation for Non-Incident Ticket Types\n\n**Previous Behavior:**\nWhen closing an XSOAR incident (status = \"Done\"), the integration would:\n1. Check if the user manually set the ServiceNow state to \"7 - Closed\" in the delta\n2. If the ticket type was NOT \"incident\" AND no custom close state was configured\n3. Automatically translate state \"7\" to the appropriate closure state for that ticket type using `TICKET_TYPE_TO_CLOSED_STATE` mapping\n\n**Code that was removed:**\n```python\nif closure_case:\n    # Convert the closing state to the right one if the ticket type is not incident \n    # in order to close the ticket/incident via XSOAR\n    if parsed_args.data.get('state') == '7 - Closed' and not is_custom_close:\n        fields['state'] = TICKET_TYPE_TO_CLOSED_STATE[ticket_type]\n```\n\n**New Behavior:**\n- When an XSOAR incident is closed (status = \"Done\"), the integration uses the configured closure method (`close_ticket` or `close_ticket_multiple_options` parameters)\n- The closure method determines the target state based on `TICKET_CLOSURE_STATES` mapping\n- Manual state changes in the delta are treated as regular field updates, NOT as closure operations\n- No automatic translation of state \"7\" occurs for any ticket type\n\n**Reason:**\n- Provides clearer separation between XSOAR incident closure and ServiceNow state management\n- Eliminates confusion about when automatic state translation occurs\n- Makes closure behavior more predictable and testable\n\n**Impact:**\n- Users who relied on automatic state \"7\" translation for non-incident ticket types must now:\n  - Use the integration's closure parameters (`close_ticket` or `close_ticket_multiple_options`)\n  - OR manually provide the correct state code for their ticket type when updating the state field\n\n---\n\n### 3. Added Required Field Defaults for Incident Ticket Type States 6 and 7\n\n**Previous Behavior:**\n- Required fields (close_code, close_notes) were not automatically populated for Incident tickets.\n- Updates to states \"6\" (Resolved) or \"7\" (Closed) would fail if these fields were not provided.\n\n**New Behavior:**\n- When updating Incident ticket type to state \"6\" (Resolved) or \"7\" (Closed), the integration now automatically adds default values for required fields if not provided:\n  - `close_code`: \"Resolved by Cortex XSOAR\" (default)\n  - `close_notes`: \"Ticket closed via Cortex XSOAR mirroring.\" (default)\n- User-provided values for these fields are always preserved and never overwritten.\n- This behavior applies ONLY to Incident ticket type with states \"6\" or \"7\".\n- Other ticket types (Problem, Change Request, SIR, etc.) do not receive automatic default values.\n\n**Reason:**\n- ServiceNow requires close_code and close_notes for Incident tickets in states \"6\" and \"7\".\n- Prevents API validation errors when closing Incident tickets without explicit closure fields.\n\n**Impact:**\n- Incident tickets will now successfully close even when closure fields are not explicitly provided.\n- Users can override default values by explicitly providing close_code and close_notes in the update delta.\n\n---"
}