{
    "allRead": true,
    "allReadWrite": true,
    "data": "[\n    {\n        \"issueTypeId\": \"AdobeFlash\",\n        \"remediationGuidance\": \"1: Best practice is to not expose end of life (EOL) software to the internet.\\n2: Evaluate all devices utilizing Adobe Flash Player and where possible remove all existing Adobe Flash Player installations.  https://www.adobe.com/products/flashplayer/end-of-life.html\"\n    },\n    {\n        \"issueTypeId\": \"AjpServer\",\n        \"remediationGuidance\": \"The Apache JServ Protocol (AJP) is a protocol that can proxy inbound requests from a web server to an application server that sits behind the web server. AJP should never be exposed to the internet.\\n\\n1: Identify the exposed server running AJP and evaluate if there is any PII or sensitive information on the appliance to understand the impact.\\n2: Secure the network by blocking outbound AJP on TCP port 8009.\\n3: It is recommended to define the strong secret key attribute requiredSecret in server.xml. This sets AJP protocol authentication credentials and ensures that only requests from authenticated workers will be honored\\n4: Any instance of Apache Tomcat server should be updated to the latest version which will also update AJP.\\n5: AJP / Tomcat server security best practices can be followed https://tomcat.apache.org/tomcat-9.0-doc/security-howto.html.\"\n    },\n    {\n        \"issueTypeId\": \"AmazonSimpleStorageService\",\n        \"remediationGuidance\": \"Security best practices for Amazon S3 can be found https://docs.aws.amazon.com/AmazonS3/latest/userguide/security-best-practices.html.\"\n    },\n    {\n        \"issueTypeId\": \"AppleCups\",\n        \"remediationGuidance\": \"1: CUPS servers should not be directly accessible from the internet as they pose a significant risk as vulnerabilities are constantly being found for the service. Evaluate if this CUPS server needs to be exposed to the public internet for business purposes.\\n2: If the server does need to be exposed to the public internet or an internal network, Xpanse recommends reconfiguring the server to leverage the Internet Printing Protocol (IPP) along with Access Control Lists (ACL), authentication, and encrypted communication.\\n3: Configuration of secure IPP can be found https://www.rfc-editor.org/rfc/rfc7472.html.\\n4: Update to the latest secure version.\"\n    },\n    {\n        \"issueTypeId\": \"AtlassianCrucible\",\n        \"remediationGuidance\": \"Determine whether this asset should be exposed to the public internet or not.\\nAfterwards, work with the asset owner to remove the asset should it be determined that the asset should not be publicly accessible.\"\n    },\n    {\n        \"issueTypeId\": \"AtlassianFisheye\",\n        \"remediationGuidance\": \"Determine whether this asset should be exposed to the public internet or not.\\nAfterwards, work with the asset owner to remove the asset should it be determined that the asset should not be publicly accessible.\"\n    },\n    {\n        \"issueTypeId\": \"AtlassianJiraServer\",\n        \"remediationGuidance\": \"Evaluate whether the JIRA Server must be accessible on the public internet. JIRA servers that contain sensitive information should remain on internal networks. If a JIRA server must be publicly available, adhere to the following best practices:\\n\\n1: Require all accounts to use MFA.\\n2: Refuse anonymous user access. This will require all users to be logged in to view data.\\n3: Take a least privilege approach when determining which access different user groups should have.\\n4. Stay up to date with the latest Attlasian Security Advisories: https://confluence.atlassian.com/jira/security-advisories-112853939.html\"\n    },\n    {\n        \"issueTypeId\": \"Bod1801NonCompliantWebServer\",\n        \"remediationGuidance\": \"1: Best practice is to remove support for known-weak cryptographic protocols and ciphers.\\n2: Evaluate if there is any PII or sensitive information on the web server to understand the impact. Identify all versions of SSL/TLS and corresponding ciphers.\\n3: Follow the guidance set forth by CISA to ensure weak protocols and ciphers have been updated to the approved versions.  https://www.cisa.gov/binding-operational-directive-18-01\"\n    },\n    {\n        \"issueTypeId\": \"CiscoSecureAccessControlSystem\",\n        \"remediationGuidance\": \"If for any reason it is determined that this device should not be publicly exposed to the internet, identify the asset owner and work to restrict access to the device.\\nOrganizations should follow Cisco\u0026#39;s security best practices and ensure instances are up to date and configured securely.\"\n    },\n    {\n        \"issueTypeId\": \"ClarioClinicalTrialManagementSystems\",\n        \"remediationGuidance\": \"1: Medical record systems should not be directly accessible from the internet as they pose a significant risk to exposing Protected Health Information (PHI).\\n\\n2: It is imperative to take a risk based approach considering legal and regulatory issues associated with having a medical record system exposed to the internet.\\n\\n3: Guidelines and regulatory policy regarding securing Electronic health Records (EHR) can be found https://www.hhs.gov/hipaa/index.html\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedAjpServer\",\n        \"remediationGuidance\": \"AJP Servers are not designed to be used over the Internet and should never be exposed publicly.\\nCo-located AJP Server issues are derived from the same cloud IP address of a known certificate or domain in your asset inventory. Due to the potential for ephemerality and multi-tenancy it is important to identify the AJP server and ensure it is configured correctly.\\nIt is also recommended to reach out to the applicable cloud service provider for further security / mitigation recommendations.\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedElasticsearchServer\",\n        \"remediationGuidance\": \"1: Elasticsearch servers should never be accessible from the Internet as they are not security hardened and regularly have exploits released for them.\\n2: Co-located Elasticsearch server issues are derived from the same cloud IP address of a known certificate or domain in your asset inventory. Due to the potential for ephemerality and multi-tenancy it is important to identify the Elasticsearch servers and ensure they are configured correctly.\\n3: Identify the IP address, certificate, and domain that is allowing co-location to occur. Configure the Elasticsearch server to ensure it is no longer leveraging co-located settings.\\n4: Security best practices can be followed from Elastic https://www.elastic.co/guide/en/elasticsearch/reference/current/configuring-stack-security.html\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedMemcachedServer\",\n        \"remediationGuidance\": \"A co-located Memcached server poses significant risk as Memcached systems may contain sensitive information and should not be externally accessible as they are not hardened against external attacks.\\n1: Identify the exposed Memcached server and evaluate if there is any PII or sensitive information on the appliance to understand the impact.\\n2: Co-located Memcached server issues are derived from the same cloud IP address of a known certificate or domain in your asset inventory. Due to the potential for ephemerality and multi-tenancy it is important to identify the Memcached servers and ensure they are configured correctly.\\n3: Identify the IP address, certificate, and domain that is allowing co-location to occur. Configure the Memcached systems to ensure it is no longer leveraging co-located settings.\\n4: It is recommended to bind Memcached to a local interface and Disable UDP on the Memcached system (Disabling TCP on the public interface is also recommended but can cause issues with accessing resources outside of the internal network).\\n5: It is also recommended to reach out to the applicable cloud service provider for further security / mitigation recommendations.\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedMicrosoftDnsServer\",\n        \"remediationGuidance\": \"1: Unpatched and misconfigured Microsoft DNS Servers pose a serious security risk to any organization as severe vulnerabilities have been recently released including remote code execution (RCE).\\n2: Co-located Microsoft DNS Server issues are derived from the same cloud IP address of a known certificate or domain in your asset inventory. Due to the potential for ephemerality and multi-tenancy it is important to identify the Microsoft DNS Servers and ensure they are configured correctly.\\n3: Identify the IP address, certificate, and domain that is allowing co-location to occur. Configure the Microsoft DNS Server to ensure it is no longer leveraging co-located settings.\\n4: Microsoft DNS Server best practices can be followed https://activedirectorypro.com/dns-best-practices/\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedMongoServer\",\n        \"remediationGuidance\": \"MongoDB servers and database servers in general should not be publicly accessible over the internet as they almost always contain sensitive data and are not intended to be deployed in this way.\\n\\n1: Identify the exposed MongoDB server and evaluate if there is any PII or sensitive information on the appliance to understand the impact.\\n2: Co-located MongoDB server issues are derived from the same cloud IP address of a known certificate or domain in your asset inventory. Due to the potential for ephemerality and multi-tenancy it is important to identify the MongoDB servers and ensure they are configured correctly.\\n3: Identify the IP address, certificate, and domain that is allowing co-location to occur. Configure the MongoDB server to ensure it is no longer leveraging co-located settings.\\n4: It is also recommended to reach out to the applicable cloud service provider for further security / mitigation recommendations.\\n5: MongoDB server security best practices can be followed https://www.mongodb.com/docs/manual/administration/security-checklist/.\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedMssqlServer\",\n        \"remediationGuidance\": \"MSSQL servers (or SQL servers of any kind) should not be publicly accessible over the Internet as they regularly contain sensitive enterprise information and are not hardened to the same security standards as systems designed to be publicly accessible, putting them at risk of compromise.\\n\\n1: Co-located MSSQL server issues are derived from the same cloud IP address of a known certificate or domain in your asset inventory.\\n2: Due to the potential for ephemerality and multi-tenancy it is important to identify the MSSQL servers and ensure they are removed.\\n3: It is also recommended to reach out to the applicable cloud service provider for further security / mitigation recommendations.\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedMulticastDnsServer\",\n        \"remediationGuidance\": \"Unpatched and misconfigured Colocated Multicast DNS (mDNS) Servers pose a serious security risk to any organization as mDNS servers are vulnerable to propagating data spills and DDoS related attacks.\\n\\n1: mDNS servers contain information or are capable of obtaining information about your network infrastructure to include hostnames, IP address, and other device information.\\nThis can lead to attackers gaining information about your network architecture and the devices that reside on your network.\\n2: mDNS servers can be leveraged for reflective/amplification DoS/DDoS attacks against your organization or other organizations. This is due to the nature of the way DNS/mDNS works. Specifically, mDNS servers are designed to send multicast requests to every host on the network they reside on which can lead to network degradation or outages on your network. Additionally, they can be used to respond to addresses making the request externally, therefore if the IP address were to be spoofed, they would likely reply to that IP instead of the actual requesting IP leading to a use for external DDoS/DoS.\\n3: Co-located mDNS server issues are derived from the same cloud IP address of a known certificate or domain in your asset inventory. Due to the potential for ephemerality and multi-tenancy it is important to identify the mDNS servers and ensure they are configured correctly.\\n4:Identify the IP address, certificate, and domain that is allowing co-location to occur. Configure the mDNS server to ensure it is no longer leveraging co-located settings.\\n5:It is also recommended to reach out to the applicable cloud service provider for further security / mitigation recommendations.\\n6: Ensure mDNS servers are not configured to be public facing or available via the internet.\\n7: mDNS servers can provide a quick, easy, under the radar method for attackers who have infiltrated your organization to map assets on the network. To provide detection for this ensure verbose logging is available and detections are built on these logs for anomalies such as a 30 day look-back for IP addresses first observed, high query counts, and other potentially nefarious indicators. To provide protection against this implement zero-trust on your mDNS server by allow-list implementation on your mDNS server or devices routing to the mDNS server.\\n8: Microsoft mDNS Server best practices can be followed here: https://techcommunity.microsoft.com/t5/networking-blog/mdns-in-the-enterprise/ba-p/3275777\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedMysqlServer\",\n        \"remediationGuidance\": \"MySQL servers (or SQL servers of any kind) should not be publicly accessible over the Internet as they regularly contain sensitive enterprise information and are not hardened to the same security standards as systems designed to be publicly accessible, putting them at risk of compromise.\\n\\n1: Co-located MySQL server issues are derived from the same cloud IP address of a known certificate or domain in your asset inventory.\\n2: Due to the potential for ephemerality and multi-tenancy it is important to identify the MySQL servers and ensure they are removed.\\n3: It is also recommended to reach out to the applicable cloud service provider for further security / mitigation recommendations.\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedNetBiosNameServer\",\n        \"remediationGuidance\": \"NetBIOS name servers should never be exposed to the public internet as they leak information about users, hostnames, internal IP addresses, services, and operating systems on a local network, and are also not hardened to the same standard as systems designed to be public facing, putting them at risk for exploitation.\\n\\nBest practice is to not have NetBIOS be publicly accessible from the internet.\\n\\nCo-located NetBIOS name server issues are derived from the same cloud IP address of a known certificate or domain in your asset inventory. Due to the potential for ephemerality and multi-tenancy it is important to identify the NetBIOS name servers and ensure they are configured correctly. It is also recommended to reach out to the applicable cloud service provider for any other recommendations.\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedOpenBgpServer\",\n        \"remediationGuidance\": \"BGP servers are naturally exposed to the internet as they allow for routing between networks. BGP servers, if not properly secured, can result in malicious rerouting of internet traffic and eavesdropping.\\n\\n1: Identify the exposed BGP server and evaluate if there is any PII or sensitive information on the appliance to understand the impact.\\n2: Co-located BGP server issues are derived from the same cloud IP address of a known certificate or domain in your asset inventory. Due to the potential for ephemerality and multi-tenancy it is important to identify the BGP servers and ensure they are configured correctly.\\n3: Identify the IP address, certificate, and domain that is allowing co-location to occur. Configure the BGP server to ensure it is no longer leveraging co-located settings.\\n4: It is also recommended to reach out to the applicable cloud service provider for further security / mitigation recommendations.\\n5: BGP server security best practices from the NSA can be followed https://www.nsa.gov/portals/75/documents/what-we-do/cybersecurity/professional-resources/ctr-guide-to-border-gateway-protocol-best-practices.pdf.\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedPostgresServer\",\n        \"remediationGuidance\": \"Postgres servers and database servers in general should not be publicly accessible over the internet as they almost always contain sensitive data and are not intended to be deployed in this way.\\n\\n1: Identify the exposed Postgres server and evaluate if there is any PII or sensitive information on the appliance to understand the impact.\\n2: Co-located Postgres server issues are derived from the same cloud IP address of a known certificate or domain in your asset inventory. Due to the potential for ephemerality and multi-tenancy it is important to identify the Postgres servers and ensure they are configured correctly.\\n3: Identify the IP address, certificate, and domain that is allowing co-location to occur. Configure the Postgres server to ensure it is no longer leveraging co-located settings.\\n4: It is also recommended to reach out to the applicable cloud service provider for further security / mitigation recommendations.\\n5: Postgres server security best practices can be followed https://www.postgresql.org/docs/current/runtime.html\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedPptpServer\",\n        \"remediationGuidance\": \"Point-to-Point Tunneling Protocol (PPTP) is a VPN protocol that is widely considered obsolete and extremely insecure.\\nPPTP servers should be replaced with a modern VPN server immediately.\\n\\n1: Co-located PPTP server issues are derived from the same cloud IP address of a known certificate or domain in your asset inventory.\\n2: Due to the potential for ephemerality and multi-tenancy it is important to identify the PPTP servers and ensure they are removed.\\n3: It is also recommended to reach out to the applicable cloud service provider for further security / mitigation recommendations.\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedRdpServer\",\n        \"remediationGuidance\": \"Recommendations to reduce the likelihood of malicious RDP attempts are as follows:\\n\\n1: Best practice is to not have RDP publicly accessible on the internet.\\n2: Implement a risk-based approach that prioritizes patching RDP vulnerabilities that have known weaponized public exploits.\\n3: Limit RDP access to a specific user group.\\n4:  Implement lockout policies to protect against RDP brute-forcing.\\n5: Enable NLA (Network Level Authentication) which is non-default on older versions.\\n6: If remote access to RDP or terminal services is a business requirement, it should only be made accessible through a secure Virtual Private Network (VPN) connection with multi-factor authentication (MFA) to the corporate network or through a zero-trust remote access gateway.\\n\\nFor co-located issues, follow best practice security recommendations from the applicable cloud service provider.\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedRedisServer\",\n        \"remediationGuidance\": \"Redis servers should never be publicly accessible over the internet as they contain no authentication mechanism and all data is stored in clear text.\\n\\n1: Identify the exposed Redis server and evaluate if there is any PII or sensitive information on the appliance to understand the impact.\\n2: Co-located Redis server issues are derived from the same cloud IP address of a known certificate or domain in your asset inventory. Due to the potential for ephemerality and multi-tenancy it is important to identify the Redis servers and ensure they are configured correctly.\\n3: Identify the IP address, certificate, and domain that is allowing co-location to occur. Configure the Redis server to ensure it is no longer leveraging co-located settings.\\n4: It is also recommended to reach out to the applicable cloud service provider for further security / mitigation recommendations.\\n5: Redis server security best practices can be followed https://redis.io/docs/manual/security/.\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedRpcBindServer\",\n        \"remediationGuidance\": \"Rpcbind servers can leak unnecessary information about the corporate environment. Due to this, it is recommended that they should not be exposed to the internet.\\nCo-located rpcbind server issues are derived from the same cloud IP address of a known certificate or domain in your asset inventory. Due to the potential for ephemerality and multi-tenancy it is important to identify the rpcbind server and ensure it is configured correctly.\\nIt is also recommended to reach out to the applicable cloud service provider for further security / mitigation recommendations.\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedRsyncServer\",\n        \"remediationGuidance\": \"Co-located Rsync servers should not be exposed to the internet as they may contain sensitive information especially since data exposure has become a prominent business risk to organizations.\\n\\n1: Identify the exposed Rsync server and evaluate if there is any PII or sensitive information on the appliance to understand the impact.\\n2: Co-located Rsync server issues are derived from the same cloud IP address of a known certificate or domain in your asset inventory. Due to the potential for ephemerality and multi-tenancy it is important to identify the Rsync servers and ensure they are configured correctly.\\n3: Identify the IP address, certificate, and domain that is allowing co-location to occur. Configure the Rsync server to ensure it is no longer leveraging co-located settings.\\n4: It is also recommended to reach out to the applicable cloud service provider for further security / mitigation recommendations.\\n5: Rsync should be configured with hosts allow and hosts deny directives in order to follow least privilege principles.\\n6: Rysnc should then be setup to use the auth users directive which narrows the attack surface by user.\\n7: SSH should be leveraged for all Rysnc communication to allow for encryption.\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedRtspServer\",\n        \"remediationGuidance\": \"Real Time Streaming Protocol (RTSP)(RFC2326) is an outdated and insecure protocol with multiple publicly available exploits. RTSP generally resides in embedded systems that are not intended to be exposed to the public internet.\\n\\n1: Identify the exposed RTSP server and evaluate if there is any PII or sensitive information on the appliance to understand the impact.\\n2: Co-located RTSP server issues are derived from the same cloud IP address of a known certificate or domain in your asset inventory. Due to the potential for ephemerality and multi-tenancy it is important to identify the RTSP servers and ensure they are configured correctly.\\n3: Identify the IP address, certificate, and domain that is allowing co-location to occur. Configure the RTSP server to ensure it is no longer leveraging co-located settings.\\n4: It is also recommended to reach out to the applicable cloud service provider for further security / mitigation recommendations.\\n5: Check with the manufacture for security guidance and updates for any device containing the RTSP protocol.\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedSipServer\",\n        \"remediationGuidance\": \"1: Co-located Session Initiation Protocol (SIP) issues are derived from the same cloud IP address of a known certificate or domain in your asset inventory. Due to the potential for ephemerality and multi-tenancy it is important to identify the SIP devices and ensure they are configured correctly.\\n2: Identify the IP address, certificate, and domain that is allowing co-location to occur. Configure the SIP device to ensure it is no longer configured with co-located settings.\\n3: Maintain SIP systems behind a firewall or through a VPN.\\n4: If your organization\u0026#39;s SIP server needs to be exposed to the internet, then using high-entropy passwords, lockout policy, and traffic inspection is recommended.\\n5: Ensure that usernames are not based on extensions since most brute force attacks will attempt an extension match.\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedSmbServer\",\n        \"remediationGuidance\": \"Co-located Server Message Block (SMB) servers should never be exposed to the internet as they are frequently targeted in cyber-attacks.\\n\\n1: Identify the exposed Server Message Block (SMB) server and evaluate if there is any PII or sensitive information on the appliance to understand the impact.\\n2: Co-located SMB server issues are derived from the same cloud IP address of a known certificate or domain in your asset inventory. Due to the potential for ephemerality and multi-tenancy it is important to identify the SMB servers and ensure they are configured correctly.\\n3: Identify the IP address, certificate, and domain that is allowing co-location to occur. Configure the SMB server to ensure it is no longer leveraging co-located settings.\\n4: Secure the network perimeter by blocking connections to all versions of SMB for TCP ports 445 and 139 and UDP ports 137 and 138.\\n5: It is also recommended to reach out to the applicable cloud service provider for further security / mitigation recommendations.\\n6: SMB server security best practices can be followed https://www.cisa.gov/uscert/ncas/current-activity/2017/01/16/SMB-Security-Best-Practices.\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedTelnetServer\",\n        \"remediationGuidance\": \"A co-located Telnet server poses significant risk as Telnet should never be exposed to the internet and, where possible, should be replaced with Secure Shell (SSH)\\n\\n1: Identify the exposed Telnet server and evaluate if there is any PII or sensitive information on the appliance to understand the impact.\\n2: Co-located Telnet server issues are derived from the same cloud IP address of a known certificate or domain in your asset inventory. Due to the potential for ephemerality and multi-tenancy it is important to identify the Telnet servers and ensure they are configured correctly.\\n3: Identify the IP address, certificate, and domain that is allowing co-location to occur. Configure the Telnet systems to ensure it is no longer leveraging co-located settings.\\n4: It is also recommended to reach out to the applicable cloud service provider for further security / mitigation recommendations.\\n5: Where possible, replace existing Telnet usage with SSH. If this is not feasible follow recommended guidelines set forth by the manufacturer to mitigate Telnet exposure.\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedUnencryptedFtpServer\",\n        \"remediationGuidance\": \"Unencrypted File Transfer Protocol (FTP) servers should never be accessible from the internet as they are not security hardened and regularly have exploits released for them.\\nCo-located FTP server issues are derived from the same cloud IP address of a known certificate or domain in your asset inventory. Due to the potential for ephemerality and multi-tenancy it is important to identify the FTP servers and ensure they are configured correctly.\\n1: Identify the IP address, certificate, and domain that is allowing co-location to occur. Configure the FTP server to ensure it is no longer leveraging co-located settings.\\n2: Evaluate if there is any PII or sensitive information on the server to understand the impact of the FTP Server transmitting unencrypted information.\\n3: Xpanse recommends reconfiguring the server to only accept encrypted FTPS connections or decommissioning the FTP Server and switching to a more modern secured and encrypted file transfer technology.\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedUpnpServer\",\n        \"remediationGuidance\": \"The Universal Plug and Play (UPnP) protocol allows devices to export services and should not be directly accessible from the internet. There are multiple known vulnerabilities with public exploits available for UPnP libraries.\\n\\n1: Identify the exposed UPnP server and evaluate if there is any PII or sensitive information on the appliance to understand the impact.\\n2: Co-located UPnP server issues are derived from the same cloud IP address of a known certificate or domain in your asset inventory. Due to the potential for ephemerality and multi-tenancy it is important to identify the UPnP servers and ensure they are configured correctly.\\n3: Identify the IP address, certificate, and domain that is allowing co-location to occur. Configure the UPnP server to ensure it is no longer leveraging co-located settings.\\n4: Secure the network perimeter by blocking connections to all versions of UPnP for UDP port 1900.\\n5: It is also recommended to reach out to the applicable cloud service provider for further security / mitigation recommendations.\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedVncServer\",\n        \"remediationGuidance\": \"VNC servers should not be directly exposed to the internet as it is frequently targeted and exploited by threat actors as an initial access or backdoor vector. The following should be evaluated and performed:\\n\\n1: Disable or remove the service from the internet.\\n2: Review whether VNC is absolutely necessary and see if tunneling VNC over SSH or a VPN can be utilized instead.\\n3: Use VNC implementations that encrypt the entire VNC session, including password authentication and data transfer.\\n\\nFor colocated issues, follow best practice security recommendations from the applicable cloud service provider.\"\n    },\n    {\n        \"issueTypeId\": \"ColocatedXmppServer\",\n        \"remediationGuidance\": \"XMPP servers should not be accessible on the public internet.  If an attacker gains access to an XMPP server, they could view the company structure, perform service discovery, and read messages with confidential information. If an XMPP server must be accessible on the public internet, ensure that:\\n1: The server is running with a server certificate.\\n2: The server is configured to not allow any cleartext client-to-server or server-to-server communications.\\n3: The server supports XEP-0198 and XEP-0124 protocol extensions.\\n4: Action is taken to prevent denial of service attacks, such as limiting the amount of connections from a single client.\\n\\nFor co-located issues, follow best practice security recommendations from the applicable cloud service provider.\"\n    },\n    {\n        \"issueTypeId\": \"DataStorageAndAnalysis\",\n        \"remediationGuidance\": \"Data storage devices, such as network attached storage servers, often contain highly confidential data and should not be exposed to the public internet.\\n1: It is recommended to identify the asset and work to remove it from being accessible from the internet and instead allow access via a VPN.\\n2: If the asset needs to be exposed to the internet for a business purpose, it is recommended to place the device behind a Firewall or Web Application Firewall (WAF) with proper alerting and logging configured.\"\n    },\n    {\n        \"issueTypeId\": \"DefaultApacheTomcatPage\",\n        \"remediationGuidance\": \"Compromise of a Tomcat landing page could allow an adversary to connect to the management portal, change the configuration, upload new applications, or run arbitrary code on the server. It is recommended to edit \u0026#34;httpd.conf\u0026#34; to display a custom page or removing the file entirely, which will display HTTP 404 error instead of the Tomcat homepage.\"\n    },\n    {\n        \"issueTypeId\": \"DevelopmentEnvironment\",\n        \"remediationGuidance\": \"With some exceptions, development environments should not be accessible on the public internet. Development environments tend to be less stable and secure than production environments. If a development environment must be publicly accessible, follow these best practices:\\n\\n1: Utilize MFA on development and user test accounts.\\n2: Ensure external libraries and frameworks are up-to-date with the latest security patches.\\n3: Log and monitor traffic coming to and from the development environment.\\n4: Carefully track access to secret keys and credentials.\"\n    },\n    {\n        \"issueTypeId\": \"DjangoAdminPage\",\n        \"remediationGuidance\": \"When left unpatched or misconfigured, applications written in Django pose a serious security risk due to the 90\u0026#43; public CVEs associated with this framework.\\n\\n1: Ensure your organization is running the latest version of Django to prevent known/active exploits from being successfully ran against your web applications.\\n2: Never place admin logins for applications on a public facing asset or, if necessary, do not make the accessible from the internet.\\n3: Ensure best practices are being followed for input sanitation to prevent successful injection attacks.\\n4: Enable robust application and server logging to monitor for nefarious activities such as XSS, fuzzing, port/host discovery scanning, vulnerability scanning, SQL injection, file inclusion attacks, brute force activities, and cross-site request forgery.\\n5: Place your web applications behind network security devices on your edge (such as WAFs) and enable monitoring on these devices along with DDoS mitigation functions.\"\n    },\n    {\n        \"issueTypeId\": \"DockerRegistry\",\n        \"remediationGuidance\": \"A compromised Docker Registry server may provide an attacker with access to an organization\u0026#39;s Docker images.\\nIt is recommended to evaluate whether this service should be exposed to the internet or not.\\nIf the service needs to be exposed to the internet for a business purpose, it is recommended to put the device behind security tooling such as a Web Application Firewall (WAF) with appropriate logging and alerting enabled.\"\n    },\n    {\n        \"issueTypeId\": \"DomainControlValidatedCertificate\",\n        \"remediationGuidance\": \"While most browsers will accept domain control validated certificates, they are generally seen as a less-secure certificate due to lax identity verification. Domain control validated certificates are often used by cyber criminals to impersonate websites. Reputable websites should use trusted Certificate Authorities (CA) and opt for high-assurance validation methods, such as Extended Validation.\"\n    },\n    {\n        \"issueTypeId\": \"ExpiredWhenScannedCertificate\",\n        \"remediationGuidance\": \"Expired certificates on active services are a good indication that a system may not be under active management. This can result in a lack of trust from external parties due to the web browser\u0026#39;s warning for expired certificate.\\n1: Best practice is to establish a formal SSL/TLS server certificate management program that tracks all certificates including the expiration date in a central location. \\n2: Identify all existing certificates and their expiration dates. For certificates that have expired follow established procedure to revoke and replace the certificate.\\n3: NIST has released Special Publication 1880-16A that provides in-depth guidance on securing web transactions. https://www.nccoe.nist.gov/publication/1800-16/VolA/index.html\"\n    },\n    {\n        \"issueTypeId\": \"ExpiringCertificate\",\n        \"remediationGuidance\": \"Expired certificates and certificates about to expire on active services are a good indication that a system may not be under active management. This can result in a lack of trust from external parties due to the web browser\u0026#39;s warning for expired certificate.\\n\\n1: Best practice is to establish a formal SSL/TLS server certificate management program that tracks all certificates including the expiration date in a central location. \\n2: Identify all existing certificates and their expiration dates. For certificates that have expired or are about to expire follow established procedure to revoke and replace the certificate.\\n3: NIST has released Special Publication 1880-16A that provides in-depth guidance on securing web transactions https://www.nccoe.nist.gov/publication/1800-16/VolA/index.html.\"\n    },\n    {\n        \"issueTypeId\": \"ExpiringDomain\",\n        \"remediationGuidance\": \"Due to the fact that expired domains lead to significant security risks, certificates should be renewed prior to their expiry date.\"\n    },\n    {\n        \"issueTypeId\": \"ExposedDirectoryListing\",\n        \"remediationGuidance\": \"Directory listing is a web server feature that displays an index of all the resources in a website’s directory. Malicious actors can use the critical information gained from exposed directory listings to discover vulnerabilities that could be exploited in your organization’s environment. It is recommended to take the following steps to secure your environment:\\n\\n1: Disable directory listings in your web server’s configuration for all paths. You can also place an empty *index.html* file in the web server root, which will instead display an empty page. This approach doesn’t provide a strong level of protection and is only recommended as a temporary solution until the web server configuration can be updated.\\n2: Verify that directory metadata is hidden.\\n3: Review your application’s access control policy and confirm that it conforms to current security best practices.\\n\\nFurther documentation:  https://owasp.org/Top10/A01_2021-Broken_Access_Control/\"\n    },\n    {\n        \"issueTypeId\": \"FujifilmSynapseRIS\",\n        \"remediationGuidance\": \"1: Medical record systems should not be directly accessible from the internet as they pose a significant risk of exposing Protected Health Information (PHI).\\n2: It is imperative to take a risk-based approach considering legal and regulatory issues associated with having a medical record system exposed to the internet.\\n3: Guidelines and U.S. regulatory policy regarding securing Electronic Health Records (EHR) can be found https://www.hhs.gov/hipaa/index.html\"\n    },\n    {\n        \"issueTypeId\": \"GitLab\",\n        \"remediationGuidance\": \"Compromise of a GitLab instance could potentially lead to source code in the repos being leaked or stolen.\\nIt is recommended to identify the asset owner and verify that GitLab needs to be exposed to the public internet. If not, work with them to remove it.\\nIf GitLab needs to be exposed to the internet, it is recommended to follow their documentation on securing the installation which can be found https://docs.gitlab.com/ee/security/\\nIt is also recommended to place the instance behind security controls such as a Web Application Firewall (WAF).\"\n    },\n    {\n        \"issueTypeId\": \"GoogleWebFrameworkAngular\",\n        \"remediationGuidance\": \"Angular when unpatched and misconfigured poses a serious security risk to any organization as severe vulnerabilities have been recently released including remote code execution (RCE).\\n\\n1: Given the nature of CVE-2021-21277 and CVE-2021-4231 Xpanse recommends enforcing strict input sanitation measures on webpages built on Angular to prevent similar exploits.\\n\\n2: Ensure monitoring is configured to detect attacks such as cross-site scripting, cross-site request forgery, SQL injection, and other nefarious activities.\"\n    },\n    {\n        \"issueTypeId\": \"Grafana\",\n        \"remediationGuidance\": \"Grafana is vulnerable to a number of critical vulnerabilities, such as CVE-2022-31107 and CVE-2022-26148, which can lead to authentication bypass and exposed passwords.\\n1: Update Grafana to the latest secure version.\\n2: Validate that the information displayed in Grafana should be publicly accessible. If not, work with the asset owner to remove the Grafana instance from the public internet.\\n3: For in-depth vendor recommendations, visit https://grafana.com/go/webinar/grafana-security-features/.\"\n    },\n    {\n        \"issueTypeId\": \"HadoopServer\",\n        \"remediationGuidance\": \"Apache Hadoop servers should not be publicly accessible over the internet as they almost always contain sensitive data and are not intended to be deployed in this way.\\n\\n1: Identify the exposed Apache Hadoop server and evaluate if there is any PII or sensitive information on the appliance to understand the impact.\\n2: Ensure that Apache Hadoop is configured in secure mode allowing for data encryption and Role Based Access Controls (RBAC).\\n3: Apache Hadoop server security best practices can be followed https://hadoop.apache.org/docs/stable/hadoop-project-dist/hadoop-common/SecureMode.html.\"\n    },\n    {\n        \"issueTypeId\": \"IBMCognosAnalytics\",\n        \"remediationGuidance\": \"Public facing instances of IBM Cognos Analytics are at far greater risk for exploitation due to multiple vulnerabilities and common attack methodologies. Additionally, hosting this service on your public facing infrastructure increases you attack surface and should be avoided if possible. Xpanse recommends restricting access to your IBM Cognos Analytics application by taking the following steps:\\n\\n1: If your organization’s IBM Cognos Analytics service must be public facing due to your network architecture place the hosting device behind a firewall and configure it to accept connections from known good IP addresses/subnets. Connections should be blocked from IP addresses not designated in your allow-list.\\n\\n2: Block all unexpected outbound network traffic to prevent potentially propagating confidential/sensitive data spills due to malware/exploits running on/against the system.\\n\\n3: Ensure you have the latest version of IBM Cognos Analytics deployed as all prior versions of the application to date have been noted as vulnerable to multiple different attack methodologies.\"\n    },\n    {\n        \"issueTypeId\": \"InsecureApacheWebServer\",\n        \"remediationGuidance\": \"1: Verify backported versions requires system access and cannot be accurately done from the Internet, it is recommended to confirm vulnerabilities on the system through a change log or other means.\\n2: Outdated versions may no longer get security updates on a regular basis and are prime targets for attackers. It is recommended to upgrade to the latest version of Apache Web Server and apply latest security updates. This can be done via https://httpd.apache.org/download.cgi.\\n3: Ensure all files outside the document root are secured with ‘require all denied’ in the server’s configuration. Details on how to do so can be found at https://httpd.apache.org/docs/2.4/misc/security_tips.html.\"\n    },\n    {\n        \"issueTypeId\": \"InsecureAppleCups\",\n        \"remediationGuidance\": \"1: CUPS servers should not be directly accessible from the internet as they pose a significant risk as vulnerabilities are constantly being found for the service. Evaluate if this CUPS server needs to be exposed to the public internet for business purposes.\\n2: If the server does need to be exposed to the public internet or an internal network, Xpanse recommends reconfiguring the server to leverage the Internet Printing Protocol (IPP) along with Access Control Lists (ACL), authentication, and encrypted communication.\\n3: Configuration of secure IPP can be found https://www.rfc-editor.org/rfc/rfc7472.html.\\n4: Update to the latest secure version.\"\n    },\n    {\n        \"issueTypeId\": \"InsecureAtlassianBamboo\",\n        \"remediationGuidance\": \"Successful exploitation of CVE-2022-26136 would allow a remote, unauthenticated attacker to bypass authentication or execute malicious Javascript in the browser by sending HTTP requests crafted so that either the authentication logic used by Servlet Filters from third party apps would not be invoked or by bypassing the Servlet Filters entirely. Exploitation of CVE-2022-26137 would involve gaining access to the Servlet Filter used to respond to CORS requests resulting in CORS bypass.\\n\\nAtlassian has not exhaustively determined all possible attack vectors for these two vulnerabilities, so the impact of exploitation could be even more severe than described.\\n\\nXpanse recommends using information surfaced by this policy to assess whether your organization’s Atlassian Bamboo Server is impacted and upgrade to the latest available patch if needed.\"\n    },\n    {\n        \"issueTypeId\": \"InsecureAtlassianConfluenceDataCenter\",\n        \"remediationGuidance\": \"In certain versions of Confluence Server and Data Center threat actors are able to remotely execute arbitrary code and view restricted resources. To reduce the likelihood of such attempts, ensure the following:\\n\\n1: Best practice is to update to current versions, as outdated versions may no longer get security updates on a regular basis and are prime targets for attackers. It is recommended to upgrade to the latest version of Confluence Server and Data Center. Latest version can be found at https://www.atlassian.com/software/confluence/download-archives.\\n2: If incremental updates cannot be achieved, there are temporary workarounds offered on Confluence Support under “Mitigation” at https://confluence.atlassian.com/doc/confluence-security-advisory-2021-08-25-1077906215.html#.\\n3: Ensure Confluence Server and Data Center is not publicly accessible on the Internet and only on trusted local networks.\"\n    },\n    {\n        \"issueTypeId\": \"InsecureAtlassianConfluenceServer\",\n        \"remediationGuidance\": \"In certain versions of Confluence Server and Data Center threat actors are able to remotely execute arbitrary code and view restricted resources. To reduce the likelihood of such attempts, ensure the following:\\n\\n1: Best practice is to update to current versions, as outdated versions may no longer get security updates on a regular basis and are prime targets for attackers. It is recommended to upgrade to the latest version of Confluence Server and Data Center. Latest version can be found at https://www.atlassian.com/software/confluence/download-archives.\\n2: If incremental updates cannot be achieved, there are temporary workarounds offered on Confluence Support under “Mitigation” at https://confluence.atlassian.com/doc/confluence-security-advisory-2021-08-25-1077906215.html#.\\n3: Ensure Confluence Server and Data Center is not publicly accessible on the Internet and only on trusted local networks.\"\n    },\n    {\n        \"issueTypeId\": \"InsecureAtlassianCrucible\",\n        \"remediationGuidance\": \"Identify the server or service owner of the affected asset and work to upgrade your Atlassian Crucible instance to version 4.8.9 or greater.\\nVendor Advisory can be found https://jira.atlassian.com/browse/FE-7387\"\n    },\n    {\n        \"issueTypeId\": \"InsecureAtlassianFisheye\",\n        \"remediationGuidance\": \"Versions of Atlassian Fisheye 4.8.9 and below may be vulnerable to CVE-2021-43958, a vulnerability allowing an attacker to brute force user login credentials.\\nXpanse recommends identifying the server or service owner of the affected asset and work to upgrade your Atlassian Fisheye instance to version 4.8.9 or greater.\\nVendor Advisory can be found https://jira.atlassian.com/browse/FE-7387.\"\n    },\n    {\n        \"issueTypeId\": \"InsecureCiscoSecureAccessControlSystem\",\n        \"remediationGuidance\": \"Versions of Cisco Secure Access Control System flagged by this policy (versions prior to 5.8 patch 9) may be vulnerable to CVE-2018-0147, an insecure deserialization vulnerability that could lead to code execution.\\nIn order to remediate, it is recommended to update the device\u0026#39;s version that was flagged by this policy to a version greater than 5.8 patch 9.\\nFurther information regarding the vulnerability and remediation recommendations can be found at the advisory from Cisco found https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180307-acs2\\nThe vendor recommends updating to the latest version of Secure Access Control System (ACS).\"\n    },\n    {\n        \"issueTypeId\": \"InsecureDrupalWebServer\",\n        \"remediationGuidance\": \"Insecure versions of Drupal Web Server have vulnerabilities that can span from Cross-Site Scripting (XSS) to Remote Code Execution.\\n1: It is recommended to upgrade the asset flagged under this policy to the latest secure version of Drupal.\\n2: Other recommendations, after the Drupal server has been updated, would be to move the asset flagged under this policy behind security tooling such as a Web Application Firewall (WAF) as well as enable appropriate logging and alerting.\\n3: More in-depth secure configuration guidance can be found on Drupal\u0026#39;s site https://www.drupal.org/security/secure-configuration\"\n    },\n    {\n        \"issueTypeId\": \"InsecureHikvisionDevice\",\n        \"remediationGuidance\": \"CVE-2021-36260 is a command injection vulnerability found in Hikvision products. Utilizing this vulnerability, an attacker could use the flagged asset as an entry point into your network.\\n1: It is recommended to upgrade the firmware of the flagged asset to the latest secure version to ensure the vulnerability is patched.\\n2: The advisory released by Hikvision, as well as information regarding specifics around affected and resolved firmware versions, can be found https://www.hikvision.com/en/support/cybersecurity/security-advisory/security-notification-command-injection-vulnerability-in-some-hikvision-products/security-notification-command-injection-vulnerability-in-some-hikvision-products/\"\n    },\n    {\n        \"issueTypeId\": \"InsecureIBMCognosAnalytics\",\n        \"remediationGuidance\": \"Public facing instances of IBM Cognos Analytics are at far greater risk for exploitation due to multiple vulnerabilities and\\n common attack methodologies. Additionally, hosting this service on your public facing infrastructure increases you attack surface and should be avoided if possible. Xpanse recommends restricting access to your IBM Cognos Analytics application by taking the following steps:\\n\\n1: If your organization’s IBM Cognos Analytics service must be public facing due to your network architecture place the hosting device behind a firewall and configure it to accept connections from known good IP addresses/subnets. Connections should be blocked from IP addresses not designated in your allow-list.\\n\\n2: Block all unexpected outbound network traffic to prevent potentially propagating confidential/sensitive data spills due to malware/exploits running on/against the system.\\n\\n3: Ensure you have the latest version of IBM Cognos Analytics deployed as all prior versions of the application to date have been noted as vulnerable to multiple different attack methodologies. If updating is not an option see below:\\n\\n\\t* In response to  https://exchange.xforce.ibmcloud.com/vulnerabilities/227591 ensure email communications to the hosting entity are filtered or blocked entirely. This can be done via port filtering on ports 25, 465, 995, 110, 993, and 143.\\n\\n\\t* In response to https://exchange.xforce.ibmcloud.com/vulnerabilities/233571 configure WAF rules to block POST requests containing .XML files. Additionally, if possible configure IBM Cognos Analytics to either not accept XML files or to not parse/accept external XML entities. These can be identified by the keyword SYSTEM under a defined entity.\"\n    },\n    {\n        \"issueTypeId\": \"InsecureMicrosoftExchangeServer\",\n        \"remediationGuidance\": \"1: To identify the version and build of Exchange follow this guidance from Microsoft.  https://docs.microsoft.com/en-us/exchange/new-features/build-numbers-and-release-dates?view\u0026#61;exchserver-2019\\n2: For end of life (EOL) versions of Exchange best practice is to immediately remove access to the internet as they no longer receive security updates and pose a significant security risk to the environment.\\n3: For Exchange servers that are not end of life, best practice is to utilize Microsoft’s Best Practice Analyzer (BPA) and evaluate the results against internal policy and Microsoft’s best practices for Exchange.\\n4: Microsoft offers Best Practice Analyzer (BPA) a tool that should be leveraged to scan existing Exchange servers for patching, security, and compliance to Microsoft Best Practices.  https://docs.microsoft.com/en-us/windows-server/administration/server-manager/run-best-practices-analyzer-scans-and-manage-scan-results\\n\\nFor recommendations on CVE-2022-41040 and CVE-2022-41082, refer to the following guidance document released by Microsoft found https://msrc-blog.microsoft.com/2022/09/29/customer-guidance-for-reported-zero-day-vulnerabilities-in-microsoft-exchange-server/.\\nThis remediation guidance will be updated as more information becomes available.\"\n    },\n    {\n        \"issueTypeId\": \"InsecureMicrosoftIisWebServer\",\n        \"remediationGuidance\": \"1: End of life (EOL) and outdated versions of software no longer get security updates on a regular basis and are a prime target for attackers. It is recommended to upgrade to a supported version of Microsoft IIS Web Server and apply latest security updates from Microsoft. Supported versions can be found at https://docs.microsoft.com/en-us/lifecycle/products/internet-information-services-iis\\n2: It is recommended to upgrade to the latest supported version and follow Microsoft IIS Web Server best practices. https://techcommunity.microsoft.com/t5/core-infrastructure-and-security/iis-best-practices/ba-p/1241577\\n3: Microsoft offers Best Practice Analyzer (BPA) a tool that should be leveraged to scan IIS servers for patching, security, and compliance to Microsoft Best Practices.  https://docs.microsoft.com/en-us/windows-server/administration/server-manager/run-best-practices-analyzer-scans-and-manage-scan-results\"\n    },\n    {\n        \"issueTypeId\": \"InsecureOpenSSH\",\n        \"remediationGuidance\": \"OpenSSH versions under 8.8 allow for methods of privilege escalation, information disclosure and modification, as well as denial of service. When using OpenSSH ensure the following:\\n\\n1: Backported versions require system access and cannot be done accurately from the Internet, it is recommended to verify vulnerabilities on the system through a change log or other means.\\n2: Outdated versions may no longer get security updates on a regular basis and are prime targets for attackers. It is recommended to upgrade to a supported version of OpenSSH and apply latest security updates. Latest versions can be found at https://www.openssh.com/openbsd.html. \"\n    },\n    {\n        \"issueTypeId\": \"InsecureOpenSSL\",\n        \"remediationGuidance\": \"OpenSSL is a commonly used toolkit and cryptography library for TLS and SSL protocols. Outdated versions of OpenSSL are exploitable to multiple known vulnerabilities including CVE-2022-0778 that allows for Denial-of-Service (DoS).\\n1: Backported versions require system access and cannot be done accurately from the internet, it is recommended to verify vulnerabilities on the system through a change log or other means.\\n2: Outdated versions may no longer get security updates on a regular basis and are prime targets for attackers. It is recommended to upgrade to a supported version of OpenSSL and apply latest security updates. Latest versions can be found at https://www.openssl.org/source/\\n3: Mitigation and update guidance can also be found https://www.openssl.org/docs/man3.0/man7/migration_guide.html\\n4: As more information regarding OpenSSL version 3.0.7 is released, this policy will be updated.\"\n    },\n    {\n        \"issueTypeId\": \"InsecureOpenSSLCve20223602Cve20223786\",\n        \"remediationGuidance\": \"OpenSSL is a commonly used toolkit and cryptography library for TLS and SSL protocols. OpenSSL versions 3.0.0 through 3.0.6 are vulnerable to a buffer overflow vulnerabilities CVE-2022-2062 and CVE-2022-3768. This may lead to remote code execution or denial-of-service.\\n\\n1: Backported versions require system access and cannot be done accurately from the internet. It is recommended to verify vulnerabilities on the system through a change log or other means.\\n2: It is recommended to upgrade to a supported version of OpenSSL and apply latest security updates. Latest versions can be found at https://www.openssl.org/source/.\\n3: This https://www.openssl.org/blog/blog/2022/11/01/email-address-overflows/ contains impact and mitigation details.\"\n    },\n    {\n        \"issueTypeId\": \"InsecurePHP\",\n        \"remediationGuidance\": \"Identify the server or service owner of the affected asset and perform the following:\\n\\nIf your version falls under End of Life (EOL):\\n1: Upgrade your PHP instance to a version that is actively supported\\n\\nIf your version receives security fixes but is still marked as insecure:\\n1: Upgrade to an actively supported PHP version\\n2: Upgrade to a PHP version that fixes the vulnerability your version falls under\\n\\nHelpful documentation on upgrading your instance (what has been depreciated or incompatibilities for older versions) can be found here: https://www.php.net/manual/en/migration80.php\"\n    },\n    {\n        \"issueTypeId\": \"InsecurePrimeTekPrimeFaces\",\n        \"remediationGuidance\": \"PrimeTek PrimeFaces version 5.x is vulnerable to CVE-2017-1000486 (a weak encryption flaw leading to remote code execution) and version 7.0.11 to CVE-2020-10544 (a cross-site scripting vulnerability).\\nTo secure the server, ensure you are using the latest version of PrimeTek PrimeFaces.\"\n    },\n    {\n        \"issueTypeId\": \"InsecurePythonApplication\",\n        \"remediationGuidance\": \"Insecure versions of Python are associated with various vulnerabilities such as access control bypass or remote code execution.\\nIt is recommended to identify the asset owner and work with them to perform any of the following:\\n1: Update the version of Python used by the application to a newer, secure version\\n2: If the version of python cannot be updated, work to remove the application from the internet\\n3: If the application cannot be removed from the internet, it is recommended to put the application behind a Web Application Firewall (WAF) or similar tool to help mitigate any attacks against the application.\"\n    },\n    {\n        \"issueTypeId\": \"InsecureQuestKaceSystemManagementAppliance\",\n        \"remediationGuidance\": \"This policy flags instances of Quest KACE system management appliance that are vulnerable to CVE-2018-11138, a remote code execution vulnerability.\\nIn order to remediate this vulnerability, it is recommended to upgrade the system to the latest secure version (above 8.0.318).\\nThe CVE entry in NIST\u0026#39;s National Vulnerability Database can be found https://nvd.nist.gov/vuln/detail/CVE-2018-11138\"\n    },\n    {\n        \"issueTypeId\": \"InsecureSignatureCertificate\",\n        \"remediationGuidance\": \"The use of weak algorithms is discouraged and presents security risks to organizations. It is recommended to use cipher suites that are considered secure such as SHA256, SHA384, SHA512, and ECDSA.\"\n    },\n    {\n        \"issueTypeId\": \"InsecureSipServer\",\n        \"remediationGuidance\": \"Secure your SIP servers by taking the following precautions:\\n\\n1: This policy specifically flags SIP configurations that have enabled the OPTIONS method. It is recommended to disable this method unless absolutely necessary, because it allows attackers to gain information about a system and craft specific attack plans against a SIP device.\\n2: Maintain SIP systems behind a firewall or through a VPN.\\n3: If the SIP server needs to be exposed to the Internet, then using high-entropy passwords, lockout policy, and traffic inspection is recommended.\\n4: Ensure that usernames are not based on extensions since most brute force attacks will attempt an extension match.\\n\\nFurther documentation:  https://datatracker.ietf.org/doc/html/rfc3261#section-26.3\"\n    },\n    {\n        \"issueTypeId\": \"InsecureSolarWindsServU\",\n        \"remediationGuidance\": \"In order to protect against CVE-2021-35211, in addition to other security vulnerabilities, ensure that SolarWinds Serv-U is running version 15.2.3 HF2 or later.\"\n    },\n    {\n        \"issueTypeId\": \"InsecureSonicWallSonicOS\",\n        \"remediationGuidance\": \"Assets identified by this policy may be vulnerable to CVE-2020-5135, a vulnerability allowing a remote attacker to cause a Denial of Service (DoS).\\nXpanse recommends identifying the affected asset or server owner and work with them to upgrade the version of SonicWall SonicOS to the latest secure version.\\nMore details regarding the vulnerability can be found at the NIST NVD entry https://nvd.nist.gov/vuln/detail/CVE-2020-5135\"\n    },\n    {\n        \"issueTypeId\": \"InsecureTLS\",\n        \"remediationGuidance\": \"Insecure versions of TLS are versions that are known to be crackable and are therefore unsafe to utilize.\\n1: It is recommended to identify the asset owner of the device flagged through this policy and work to disable insecure versions of TLS.\\n2: More information regarding detection, remediation, configuration and various tools for identification can be found at the NSA Github repository https://github.com/nsacyber/Mitigating-Obsolete-TLS\"\n    },\n    {\n        \"issueTypeId\": \"InsecureTLSStrict\",\n        \"remediationGuidance\": \"Disabling older and deprecated versions of protocols reduces the attack surface, and is recommended as a best practice for Internet facing targets.\\nIt is recommended to identify all assets that utilize deprecated SSL/TLS configurations and upgrade to cipher suites that are considered secure.\\n\\nFollow additional guidance set forth by NIST as needed:\\nhttps://csrc.nist.gov/publications/detail/sp/800-52/rev-2/final\"\n    },\n    {\n        \"issueTypeId\": \"InsecureZohoManageEnginePasswordManagerPro\",\n        \"remediationGuidance\": \"Builds of Zoho ManageEngine Password Manager Pro that are flagged by this policy are vulnerable to CVE-2022-35405; a remote code execution vulnerability.\\nIt is recommended to upgrade the flagged asset to build 12101 or later.\\nThe vendor advisory regarding this vulnerability can be found https://www.manageengine.com/products/passwordmanagerpro/advisory/cve-2022-35405.html.\"\n    },\n    {\n        \"issueTypeId\": \"InsecureZohoManageEngineServiceDeskPlus\",\n        \"remediationGuidance\": \"1: Evaluate if ManageEngine ServiceDesk Plus should be directly accessible from the internet.  Apart from rare circumstances, ManageEngine ServiceDesk Plus should be deployed on an internal network.\\n2: The Zoho ManageEngine ServiceDesk Plus Admin Guide gives detailed installation instructions.  This includes how to install certificates, manage users, and log connections.\\n3: Follow the Best Practices to help secure the application: https://download.manageengine.com/products/service-desk/servicedesk-plus-installation-best-practices-guide.pdf\"\n    },\n    {\n        \"issueTypeId\": \"IntelActiveManagementTechnology\",\n        \"remediationGuidance\": \"Exploitation of Intel Active Management Technology via CVE-2022-28697 and CVE-2022-30601 can lead to privilege escalation, while CVE-2022-30944 can lead to information disclosure.\\nIt is recommended to follow the steps provided by Intel to address these CVEs: https://www.intel.com/content/www/us/en/security-center/advisory/intel-sa-00709.html.\"\n    },\n    {\n        \"issueTypeId\": \"InternalIPAddressAdvertisement\",\n        \"remediationGuidance\": \"Internal IP addresses (RFC 1918) should be obscured by firewalls or proxy servers. When leaked on the internet they provide potential attackers with a probable entry point.\\n\\n1: Internal IP addresses should not be visible from the internet.\\n2: Identify the device that is leaking private internal IP addresses and evaluate if there is any PII or sensitive information on the appliance to understand the impact.\\n3: Verify device configurations and ensure internal IP addresses are not being broadcast.\"\n    },\n    {\n        \"issueTypeId\": \"JenkinsServer\",\n        \"remediationGuidance\": \"Mis-configured Jenkins servers may disclose sensitive information such as credentials and log files. To reduce the likelihood of such instances, verify the following:\\n\\n1: Verify that the Jenkins server is properly configured. Instructions on how to do so can be found at https://www.jenkins.io/doc/book/installing/initial-settings/.\\n2: Best practice is to ensure Jenkins server is not publicly accessible on the Internet and only on trusted local networks.\\n3: Ensure the Jenkins and plugins are up to date, information on how to do so can be found at https://www.jenkins.io/doc/book/managing/plugins/ and https://www.jenkins.io/download/.\\n4: Review user permissions, specifically for JENKINS_HOME directory and build pipelines, and evaluate if all users must be included. Further, ensure users cannot elevate their permissions. There are various Jenkins plugins that can aid in doing so.\\n5: Ensure credentials are securely stored. There are various Jenkins plugins that can aid in doing so.\"\n    },\n    {\n        \"issueTypeId\": \"Kubernetes\",\n        \"remediationGuidance\": \"The Kubernetes control plane (also called API server) should not be directly accessible from the internet as they pose a serious security risk to any organization\\n as severe vulnerabilities have been released. \\n\\n1: Identify the exposed Kubernetes server and evaluate if there is any PII or sensitive information on the appliance to understand the impact.\\n2: Ensure that Kubernetes is configured to use TLS and Role Based Access Controls (RBAC). If for some reason the Kubernetes server must be exposed to the internet leverage MFA and place the server behind a Web Application Firewall (WAF).\\n3: Kubernetes security best practices can be followed https://kubernetes.io/docs/concepts/security/\"\n    },\n    {\n        \"issueTypeId\": \"LongExpirationCertificate\",\n        \"remediationGuidance\": \"1: Best practice is to establish a formal SSL/TLS server certificate management program that tracks all certificates including the expiration date in a central location. \\n2: Identify all existing certificates and their expiration dates. For certificates with a validity period greater than 397 days follow established procedure to revoke and replace the certificate.\\n3: NIST has released Special Publication 1880-16A that provides in-depth guidance on securing web transactions. https://www.nccoe.nist.gov/publication/1800-16/VolA/index.html\"\n    },\n    {\n        \"issueTypeId\": \"MemcachedServer\",\n        \"remediationGuidance\": \"Memcached systems may contain sensitive information and should not be externally accessible as they are not hardened against external attack.\\nIt is recommended to remove the device from being publicly accessible from the internet.\\nOther configuration options that are useful for securing the Memcached system are:\\n1: Bind Memcached to a local interface\\n2: Disable UDP on the Memcached system (Disabling TCP on the public interface is also recommended but can cause issues with accessing resources outside of the internal network)\"\n    },\n    {\n        \"issueTypeId\": \"MicrosoftExchangeServer\",\n        \"remediationGuidance\": \"Due to the number and severity of recent vulnerabilities it is imperative to identify all on-premises Microsoft Exchange Servers and ensure they are fully patched and security hardened.\\n\\n1: To identify the version and build of Exchange follow this guidance from Microsoft https://docs.microsoft.com/en-us/exchange/new-features/build-numbers-and-release-dates?view\u0026#61;exchserver-2019.\\n2: For end of life (EOL) versions of Exchange best practice is to immediately remove access to the internet as they no longer receive security updates and pose a significant security risk to the environment.\\n3: For Exchange servers that are not end of life, best practice is to utilize Microsoft’s Best Practice Analyzer (BPA) and evaluate the results against internal policy and Microsoft’s best practices for Exchange.\\n4: Microsoft offers Best Practice Analyzer (BPA) a tool that should be leveraged to scan existing Exchange servers for patching, security, and compliance to Microsoft Best Practices. It can be found https://docs.microsoft.com/en-us/windows-server/administration/server-manager/run-best-practices-analyzer-scans-and-manage-scan-results.\"\n    },\n    {\n        \"issueTypeId\": \"MicrosoftOWAServer\",\n        \"remediationGuidance\": \"1: Best practice is to ensure Multi Factor Authentication (MFA) is being used on Outlook Web Access (OWA) and Office365. Guidance from Microsoft can be found here. https://docs.microsoft.com/en-us/microsoft-365/admin/security-and-compliance/set-up-multi-factor-authentication?view\u0026#61;o365-worldwide\\n2: If in use, verify Microsoft Exchanger Server is running supported versions and apply latest security updates from Microsoft. End of Life (EOL) and outdated versions of software no longer get security updates on a regular basis and are a prime target for attackers.\\n3: Permit Outlook Web Access and Office365 access only through a secure Virtual Private Network (VPN) connection. Guidance from Microsoft can be found here. https://docs.microsoft.com/en-us/microsoft-365/solutions/empower-people-to-work-remotely-remote-access?view\u0026#61;o365-worldwide\\n4: Review group policies and evaluate if all users must be included in sensitive roles. \"\n    },\n    {\n        \"issueTypeId\": \"MicrosoftWindowsServer2000\",\n        \"remediationGuidance\": \"Microsoft Windows Server 2000 has not been supported by Microsoft since 2010 and it is no longer receiving security updates. It is recommended to upgrade to a newer versions of Windows Server.\"\n    },\n    {\n        \"issueTypeId\": \"MicrosoftWindowsServer2003\",\n        \"remediationGuidance\": \"Due to extended support for Server 2003 ending on July 14, 2015 it is recommended to upgrade instances of Windows Server 2003 to either the latest version or one that is still receiving support (updates and security patches) from Microsoft or remove these assets from the internet entirely.\\nInformation on doing to can be found at https://docs.microsoft.com/en-us/windows-server/get-started/install-upgrade-migrate\"\n    },\n    {\n        \"issueTypeId\": \"MissingContentSecurityPolicyHeader\",\n        \"remediationGuidance\": \"Omitting Content Security Policy header leaves web servers vulnerable to data theft and data injection. To reduce the likelihood of such attempts, Xpanse suggests adding Content-Security-Policy (CSP) HTTP response headers to your web application. Information on how to do so can be found at https://content-security-policy.com/.\"\n    },\n    {\n        \"issueTypeId\": \"MissingStrictTransportSecurityHeader\",\n        \"remediationGuidance\": \"When HTTP Strict Transport Security (HSTS) is not enabled, threat actors can run SSL stripping attacks, making all web connections unencrypted. It is recommended to enable HTTP Strict Transport Security (HSTS) by following these steps:\\n\\n**1: Add a Strict-Transport-Security response header to your application** with the value max-age. This will inform the browser that it should not allow that web application to be accessed over HTTP during the configured time. The max-age should be set to at least one year.\\n**2: Add the includeSubDomains flag**, which will enforce HSTS at the subdomain level\\n**3: Consider submitting your application’s domain to preload lists** to prevent SSL stripping attacks on first use. If any subdomains are expected to function over HTTP, preloading may not be a feasible solution as it will make those subdomains inaccessible.\\n\\nFurther documentation:  https://cheatsheetseries.owasp.org/cheatsheets/HTTP_Strict_Transport_Security_Cheat_Sheet.html\"\n    },\n    {\n        \"issueTypeId\": \"MissingXContentTypeOptionsHeader\",\n        \"remediationGuidance\": \"Identify the server or service owner of the flagged asset and perform the following:\\nSet the X-Content-Type-Options HTTP header in the server configuration of the flagged asset to \u0026#34;nosniff\u0026#34;.\\n\\nFor information on specific configurations or other secure headers to utilize, see the following:\\n1: https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Content-Type-Options\\n2: https://owasp.org/www-project-secure-headers/\"\n    },\n    {\n        \"issueTypeId\": \"MissingXFrameOptionsHeader\",\n        \"remediationGuidance\": \"1: Best practice is to enable the X-Frame-Options header with the value DENY or SAMEORIGIN.\\n2: Evaluate the type of web server that is hosting the content with the missing X-Frame-Options header. Each web server has a slight configuration variation for X-Frame-Options headers. Mozilla has a good reference for each configuration.\\nhttps://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options\\n3: Along with the X-Frame-Options header, OWASP recommends a layered security approach. Leveraging a Content Security Policy (CSP),  SameSite cookies, or JavaScript “Frame-Buster” code will help provide defense in-depth. \\nhttps://cheatsheetseries.owasp.org/cheatsheets/Clickjacking_Defense_Cheat_Sheet.html\"\n    },\n    {\n        \"issueTypeId\": \"MissingXXssProtectionHeader\",\n        \"remediationGuidance\": \"Omitting the X-XSS-Protection header has the potential to leave web browsers vulnerable to XSS (Cross-Site Scripting) attacks. However, with modern browsers this can be mitigated with a strong Content-Security-Policy which disables the use of inline Javascript (\u0026#39;unsafe-inline\u0026#39;).\\n1: If you do not need to support older browsers, utilize Content-Security-Policy without allowing \u0026#39;unsafe-inline\u0026#39; scripts instead.\\n2: If you need to support older browsers, you can set this flag to any of the following depending on your need.\\n2a: X-XSS-Protection: 1\\n2b: This enables XSS filtering in the browser. The browser will render the page after the browser has sanitized the page if an attack is detected.\\n2c: X-XSS-Protection: 1; mode\u0026#61;block\\n2d: This enables XSS filtering in the browser. The browser will prevent rendering of the page if an attack is detected.\\n2e: X-XSS-Protection: 1; report\u0026#61; (Chromium only)\\n2f: This enables XSS filtering in the browser. The browser will render the page after the browser has sanitized the page if an attack is detected. The browser will then report the attack using the CSP \u0026#39;report-uri\u0026#39; directive to the reporting uri defined in the \u0026#39;\u0026#39; field above.\\n\\nFor more information on specific configurations and vulnerability information, please see the following:\\nhttps://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-XSS-Protection\"\n    },\n    {\n        \"issueTypeId\": \"MongoServer\",\n        \"remediationGuidance\": \"MongoDB servers and database servers in general should not be publicly accessible over the internet as they almost always contain sensitive data and are not intended to be deployed in this way.\\n\\n1: Identify the exposed MongoDB server and evaluate if there is any PII or sensitive information on the appliance to understand the impact.\\n2: Ensure that MongoDB is configured to use separate security credentials for each user and each process.  It is recommended to enable Role Based Access Controls (RBAC) for all MongoDB instances.\\n3: Leverage encryption either with TLS for data in transport or enable encryption at rest where the data is stored.\\n4: Enable auditing and logging allowing for audit trails for future investigation.\\n5: MongoDB server security best practices can be followed https://www.mongodb.com/docs/manual/administration/security-checklist/.\"\n    },\n    {\n        \"issueTypeId\": \"MoxaMXview\",\n        \"remediationGuidance\": \"Moxa MXview network management software is vulnerable to multiple critical CVEs such as CVE-2021-38452 (a path traversal vulnerability) and CVE-2021-38456 (a hardcoded password vulnerability).\\nEnsure that the latest security patches for MXview are installed.\\nVendor security advisories for MXview can be found https://www.moxa.com/en/support/product-support/security-advisory/security-advisories-all?psid\u0026#61;53389.\"\n    },\n    {\n        \"issueTypeId\": \"MssqlServer\",\n        \"remediationGuidance\": \"Publicly exposing your organization’s MSSQL servers increases the risk of being targeted by brute-force attacks. One recent example is the Vollgar campaign, a highly coordinated set of attacks believed to be originating from China that targeted publicly accessible MSSQL servers over the span of two years. It is recommended to restrict access to your MSSQL servers by taking the following steps:\\n\\n**1: Put your organization’s MSSQL server behind a firewall** and configure it to accept connections only on certain ports. Connections should be blocked on default database ports, like 1433, because those are usually the first line of attack.\\n**2: Block all unexpected outbound network traffic** to prevent malware from phoning home; confidential data.\\n**3: Disable SQL Server Browser service** to reduce your organization’s attack surface. The browser service uses UDP port 1434 and allows users to browse a list of current servers and connect to them and to administrator connection endpoints. By default, the browser service will expose the TCP port needed to connect to the MSSQL server, which is why it is recommended to specify the TCP port in the server’s connection strings.\\n\\nFurther documentation:\\n * https://docs.microsoft.com/en-us/sql/sql-server/install/configure-the-windows-firewall-to-allow-sql-server-access?view\u0026#61;sql-server-ver16\\n * https://docs.microsoft.com/en-us/sql/tools/configuration-manager/sql-server-browser-service?view\u0026#61;sql-server-ver16\"\n    },\n    {\n        \"issueTypeId\": \"MulticastDnsServer\",\n        \"remediationGuidance\": \"An exposed multicast DNS (mDNS) server could allow an attacker to query information about your network. Therefore, mDNS servers should not be accessible on the public internet.  If public exposure is necessary, consider whitelisting trusted devices and logging inbound traffic on port 5353.\"\n    },\n    {\n        \"issueTypeId\": \"MysqlServer\",\n        \"remediationGuidance\": \"It is recommended that database servers are not made accessible to the public internet. In order to securely utilize a MySQL server:\\n\\n1: Do not transmit unencrypted data to and from the MySQL server. Instead, use an encrypted protocol such as SSL or SSH.\\n2: Use a firewall to block all ingress and egress traffic from untrusted sources. If a web and database server are hosted on the same site, only expose the web server to the public internet. You can have traffic to and from the database server managed on a private LAN.\\n3: Require all MySQL accounts to have an associated password. Ensure these passwords are complex enough to withstand attacks. Consider using MFA for additional security.\\n4: Ensure you are running the latest version of MySQL server.\\n\\nFor additional security recommendations, visit https://dev.mysql.com/doc/refman/8.0/en/security.html\"\n    },\n    {\n        \"issueTypeId\": \"NetBiosNameServer\",\n        \"remediationGuidance\": \"NetBIOS is generally designed to be accessed by trusted clients inside trusted environments, therefore exposing NetBIOS directly to the Internet is not recommended.\\n\\n1: Best practice is to not have NetBIOS exposed to the Internet.\\n2: Use a firewall to filter inbound connections to NetBIOS and only allow trusted IPs and hosts.\\n3: Evaluate all devices utilizing NetBIOS and take a risk-based approach around the need for NetBIOS\"\n    },\n    {\n        \"issueTypeId\": \"NfsRpcBindServer\",\n        \"remediationGuidance\": \"Compromise of the rpcbind service could allow an adversary to query active services, and trigger unfreed memory allocations on the system leading to a remote Denial of Service. As a result, rpcbind should not be exposed to the public Internet.\\nIt is recommended to identify the asset owner and working with them to remove the device from the internet as it should not be publicly accessible.\"\n    },\n    {\n        \"issueTypeId\": \"OGWNonCompliantWebServer\",\n        \"remediationGuidance\": \"To become OGW compliant, it is recommended to:\\n\\nDisable the following protocols:\\n* SSLv2\\n* SSLv3\\n* TLS 1.0\\n* TLS 1.1\\n\\nDisable the following ciphers:\\n* RC4\\n* DES\\n* 3DES\\n* Export\\n* NULL\\n* Key sizes less than 128 bits\\n\\nDisable MD5 hashing mechanisms.\\n\\nReplace any expired certificates, ensure certificates use a key length of at least 2048 bits, replace any certificates that are not issued by the DoD or publicly trusted certificate authorities, and replace any certificates signed with MD5 or SHA1 hashes.\\n\\nAdditionally, all web servers must force connections to use HTTPS. Strict-Transport-Security headers must also be configured with a max-age greater than or equal to 31536000.\"\n    },\n    {\n        \"issueTypeId\": \"OpenBgpServer\",\n        \"remediationGuidance\": \"BGP servers are naturally exposed to the internet as they allow for routing between networks. BGP servers, if not properly secured, can result in malicious rerouting of internet traffic and eavesdropping.\\n\\n1: Identify the exposed BGP server and evaluate if there is any PII or sensitive information on the appliance to understand the impact.\\n2: Identify the manufacturer of the BGP appliance and ensure it is fully patched.\\n3: BGP server security best practices from the NSA can be followed https://www.nsa.gov/portals/75/documents/what-we-do/cybersecurity/professional-resources/ctr-guide-to-border-gateway-protocol-best-practices.pdf.\\n4: NIST has also released special guidance on securing the internet including DDoS protection for BGP https://csrc.nist.gov/publications/detail/sp/800-189/final.\"\n    },\n    {\n        \"issueTypeId\": \"OracleWebLogicServer\",\n        \"remediationGuidance\": \"Multiple classes of vulnerabilities affect Oracle Web Logic Servers (such as Remote Code Execution or Denial of Service).\\nIt is recommended to identify the asset owner and verify that the Oracle Web Logic Server needs to be exposed to the internet. If not, work with them to remove it.\\nIf the Oracle Web Logic Server needs to be exposed to the internet, it is recommended to take a look at Oracle\u0026#39;s documentation on security hardening found https://docs.oracle.com/cd/F30719_01/DESG/Content/hardening.htm\\nIt is also recommended to place the server behind security controls such as a Web Application Firewall (WAF).\"\n    },\n    {\n        \"issueTypeId\": \"OutdatedNginxWebServer\",\n        \"remediationGuidance\": \"Identify the asset owner and work with them to update the server to a stable and secure version.\\nUpgrade instructions can be found here: https://nginx.org/en/docs/install.html\\nNote: Be sure to back up your NGINX configuration before proceeding with the update.\"\n    },\n    {\n        \"issueTypeId\": \"PaloAltoNetworksFirewallAdminLoginPage\",\n        \"remediationGuidance\": \"Identify the owner of the affected asset and work with them to perform the following:\\nRemove the admin login page from the internet. For more details on how this may be accomplished (as well as other best practices for hardening your firewall\u0026#39;s admin access), please reference the following document:\\nhttps://docs.paloaltonetworks.com/pan-os/9-1/pan-os-admin/getting-started/best-practices-for-securing-administrative-access\\n\\nNote the version in the document shown on the page and ensure it matches the version your firewall is running.\"\n    },\n    {\n        \"issueTypeId\": \"PostgreSQLpgAdminLoginPortal\",\n        \"remediationGuidance\": \"Since web-based admin portals are often misconfigured and vulnerable to exploits that are trivial to run, it is essential to not publicly expose your organization’s PostgreSQL servers to the internet. Secure your PostgreSQL servers by taking the following steps:\\n\\n1: Put pgAdmin instances behind a firewall and configure it to accept connections only on a small subset of ports.\\n2: Prevent brute force password attacks by ensuring the *MAX_LOGIN_ATTEMPTS* verification check is enabled and set to 3 or another low number. You can configure this check in the User Management dialog in the pgAdmin interface or the main configuration file *config.py*. This feature is disabled if the value is set to 0.\\n3: Since PostgreSQL does not have strong password complexity checks available, the use of external authentication services is recommended. pgAdmin supports both LDAP and Kerberos and can be integrated with SSO.\\n4: Upgrade to the latest version of pgAdmin and install critical security patches. It is particularly important to update pgAdmin to version 6.7\u0026#43; to prevent directory traversal attacks.\\n\\nFurther documentation:  https://www.pgadmin.org/docs/pgadmin4/6.10/index.html\"\n    },\n    {\n        \"issueTypeId\": \"PostgreSQLpgwebLoginPortal\",\n        \"remediationGuidance\": \"It is recommended that database login portals are not made accessible to the public internet. In order to securely deploy pgAdmin:\\n\\n1: Do not transmit unencrypted data to and from the pgAdmin portal. Instead, use an encrypted protocol such as SSL or SSH.\\n2: Use a firewall to block all ingress and egress traffic from untrusted sources. If a web and database server are hosted on the same site, only expose the web server to the public internet. You can have traffic to and from the database server managed on a private LAN.\\n3: Require all database accounts to have an associated password. Ensure these passwords are complex enough to withstand common dictionary attacks.\\n4: Consider using MFA for additional security.\\n5: Ensure you are running the latest version of pgAdmin server.\"\n    },\n    {\n        \"issueTypeId\": \"PostgresServer\",\n        \"remediationGuidance\": \"1: Best practice is to not expose Postgres servers to the internet.\\n2: Evaluate if this Postgres Server needs to be exposed to the public internet for business purposes.\\n3: If the server does need to be exposed to the public internet or an internal network, it is recommended that the system is configured to listen for and accept connections on the networks that are actually required. Leveraging a layered security approach, including firewalls, encryption, roles, ACLs, and strong authentication practices will help. \\n4: If the server does not need to be exposed to the internet, the follow security guidelines set forth by Postgres https://www.postgresql.org/docs/current/runtime.html\"\n    },\n    {\n        \"issueTypeId\": \"PptpServer\",\n        \"remediationGuidance\": \"Point-to-Point Tunneling Protocol (PPTP) includes extremely weak authentication and does not establish the integrity of data transported through the PPTP VPN. To minimize the risk of such vulnerabilities, verify the following:\\n\\n1: Best practice is to replace PPTP servers with modern VPN servers immediately.\\n2: If use of PPTP is a business requirement, set Data Encryption to “Maximum strength encryption” and authentication to EAP-TLS or other alternatives to MSChap versions.\"\n    },\n    {\n        \"issueTypeId\": \"PrimeTekPrimeFaces\",\n        \"remediationGuidance\": \"There are multiple CVEs associated with PrimeTek PrimeFaces, such as CVE-2017-1000486 (a weak encryption flaw leading to remote code execution) and CVE-2020-10544 (a cross-site scripting vulnerability).\\nTo secure the server, ensure you are using the latest version of PrimeTek PrimeFaces.\"\n    },\n    {\n        \"issueTypeId\": \"PulseSecurePulseConnectSecureVPN\",\n        \"remediationGuidance\": \"Unpatched and misconfigured Pulse Secure VPN Servers pose a serious security risk to any organization as severe vulnerabilities have been released including remote code execution (RCE) with a total of over 70 CVEs published for this device.\\n\\n1: Pulse Connect Secure VPN Servers should be patched as soon as possible to prevent active exploits from being successfully ran against these devices.\\n2: VPN servers should be configured to include verbose logging to identify activities such as compromised account logins, anomalous geolocation based logins, brute force activity, injection attacks, impossible logins, single IPs hitting multiple accounts, and more.\\n3: Ensure administration/backend portals for Pulse Connect Secure VPN are not publicly available.\\n4: Ensure your IR plan for reacting to incidents involving your Pulse Connect Secure VPN include the ability to terminate sessions for users and deploy countermeasures in a swift timely manner.\\n5: Based on your organization and the nature of it\u0026#39;s business consider geolocation IP filtering for access to the user login interface.\\n6: Consider blocking known TOR exit node traffic.\\n7: If possible obfuscate the nature of the server/domain hosting Pulse Connect Secure VPNs by sanitizing applicable DNS records, server responses, and the domain name.\\n8: Pulse Secure VPN Best Practices https://docs.pulsesecure.net/WebHelp/PDC/Migration%20Guides/NC_to_PDC/Content/Links_Network_Connect_to_Pulse_Desktop_Client_Migration_Guide/Considering_Best_Practices.htm\"\n    },\n    {\n        \"issueTypeId\": \"QuestKaceSystemManagementAppliance\",\n        \"remediationGuidance\": \"If it is determined that this asset should not be publicly accessible from the internet, identify the asset owner and work with them to restrict access.\\nIf the asset needs to be exposed to the public internet for a business purpose, it is recommended to put the device behind a security tool such as a Web Application Firewall (WAF).\"\n    },\n    {\n        \"issueTypeId\": \"RdpServer\",\n        \"remediationGuidance\": \"Recommendations to reduce the likelihood of malicious RDP attempts are as follows:\\n\\n1: Best practice is to not have RDP publicly accessible on the Internet and instead only on trusted local networks.\\n2: Implement a risk-based approach that prioritizes patching RDP vulnerabilities that have known weaponized public exploits.\\n3: Limit RDP access to a specific user group and implementing lockout policies is an additional measure to protect against RDP brute-forcing which is another common tactic used by attackers. In addition, enable NLA (Network Level Authentication) which is non-default on older versions.\\n4: If remote access to RDP or terminal services is a business requirement, it should only be made accessible through a secure Virtual Private Network (VPN) connection with multi-factor authentication (MFA) to the corporate network or through a zero-trust remote access gateway.\"\n    },\n    {\n        \"issueTypeId\": \"RedisEnterpriseLoginPortal\",\n        \"remediationGuidance\": \"Redis is designed to be accessed by trusted clients inside trusted environments. Basic steps to harden Redis insances include:\\n\\n1: Redis Enterprise should be deployed on a trust network and not accessible to the public Internet.\\n2: Anti-virus exclusions should be implemented to ensure anti-virus and security solutions do not interfere with Redis Enterprise in order to maintain availability.\\n3: Send logs to a remote logging server.\\n4: Configure nodes to reboot in a sequence rather than all at once.\\n5: Implement client-side encryption if encryption in memory is required.\\n6: Implement role-based access for users.\\n7: Prevent database uses from logging into the admin console.\\n8: Disable the default user.\\n9: Enable client certificate authentication.\\n10: Leverage LDAP authentication if LDAP is used within the organization.\\n\\nAdditional recommendations:\\nhttps://docs.redis.com/latest/rs/security/\"\n    },\n    {\n        \"issueTypeId\": \"RpcBindServer\",\n        \"remediationGuidance\": \"By default, rpcbind servers have weak authentication mechanisms and have the ability to assign a wide range of ports for the services it controls.\\n1: Use a blocklist to ensure only trusted sources can communicate with rpcbind servers.\\n2: Avoid using hostnames when specifying procedure destinations, as they can be spoofed using techniques such as DNS poisoning. Instead, only use IP addresses.\\n3: For additional security recommendations, visit https://www.rfc-editor.org/rfc/rfc5531.html#section-14.\"\n    },\n    {\n        \"issueTypeId\": \"RsyncServer\",\n        \"remediationGuidance\": \"Rsync servers should not be exposed to the internet as they may contain sensitive information especially since data exposure has become a prominent business risk to organizations.\\n\\n1: Identify the exposed Rsync server and evaluate if there is any PII or sensitive information on the appliance to understand the impact.\\n2: Rsync should be configured with hosts allow and hosts deny directives in order to follow least privilege principles.\\n3: Rysnc should then be setup to use the auth users directive which narrows the attack surface by user.\\n4: SSH should be leveraged for all Rysnc communication to allow for encryption.\"\n    },\n    {\n        \"issueTypeId\": \"RtspServer\",\n        \"remediationGuidance\": \"Real Time Streaming Protocol (RTSP) should never be exposed to the internet as most RTSP servers are embedded systems that contain numerous vulnerabilities, many of which cannot be patched.\\nIt is recommended to identify the device with the RTSP server and configure the device to not be directly accessible from the internet.\"\n    },\n    {\n        \"issueTypeId\": \"SAPEmployeeSelfService\",\n        \"remediationGuidance\": \"Compromise of SAP Employee Self-Service could lead to an attacker obtaining information about employees and users.\\n1: Evaluate whether this asset should be accessible from the public internet.\\n2: If the asset needs to be accessible from the internet for a business purpose, it is recommended to place the device behind a security tool such as a Web Application Firewall (WAF) with proper logging and alerting in place.\\n3: More information regarding secure settings and configurations can be found at SAP\u0026#39;s documentation https://help.sap.com/docs/HR_RENEWAL_SPV/c05a655202604791bd0d4ab28061f934/19567493c47548ebab752643d9b5a139.html\"\n    },\n    {\n        \"issueTypeId\": \"SapNetWeaverApplicationServer\",\n        \"remediationGuidance\": \"SAP NetWeaver Application Servers if not secured properly can pose a serious security risk to any organization as severe vulnerabilities have been \\nreleased including CVE-2020-6287 allowing for unauthenticated access.\\n\\n1: Identify the exposed SAP NetWeaver Application Servers and evaluate if there is any PII or sensitive information on the appliance to understand the impact.\\n2: Identify and analyze the security settings of SAP interfaces between systems and applications to understand risks posed by these trust relationships.\\n3: Ensure that SAP NetWeaver Application Servers are configured to use TLS and Role Based Access Controls (RBAC). If for some reason the SAP NetWeaver Application Servers must be exposed to the internet leverage MFA and place the server behind a Web Application Firewall (WAF).\\n4: Follow SAP best practices and ensure all SAP NetWeaver systems are fully patched. SAP provides guidance https://help.sap.com/docs/SAP_NETWEAVER/9e41ead9f54e44c1ae1a1094b0f80712/576f5c1808de4d1abecbd6e503c9ba42.html?language\u0026#61;en-US.\"\n    },\n    {\n        \"issueTypeId\": \"Section889Violation\",\n        \"remediationGuidance\": \"Investigate the devices that have been flagged under this policy and work with the owner of the affected assets to remove them from your network.\\nFor clarification, Section 889 of the 2019 NDAA prohibits executive agencies from using equipment or services that have been flagged under this policy. (Huawei, Hikvision, Hytera, Dahua, ZTE)\"\n    },\n    {\n        \"issueTypeId\": \"SelfSignedCertificate\",\n        \"remediationGuidance\": \"1: Devices directly accessible from the internet should not be utilizing self-signed certificates. Since these certificates lack signing by a certificate authority (CA) they cannot be revoked or verified easily.\\n2: Identify the device with the self-signed certificate and identify if it should be accessible to the internet.\\n3: To replace a self-signed certitifcate with one from a certificate authority it is best practice to follow guidelines from the manufacturer, vendor, or internal documentation as this process can vary widely.\"\n    },\n    {\n        \"issueTypeId\": \"ServiceInAdversaryCountry\",\n        \"remediationGuidance\": \"Using services in adversary countries will often allow such governments to access any information stored or sent through such devices and services. If such services are found, locate possible infrastructure located in such areas. These can be previously owned and since relocated systems or devices still included in the network. If found remove such infrastructure.\"\n    },\n    {\n        \"issueTypeId\": \"ShortKeyCertificate\",\n        \"remediationGuidance\": \"The National Institute of Standards and Technology (NIST) currently recommends that RSA certificate keys use 2048-bit or greater key sizes. CA and OCSP Responder signing RSA keys should have 2048 or 3072 bits. Having smaller keys could allow attackers to crack the certificate before the certificate expires. Additional information may be found in the https://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-57Pt3r1.pdf. Table 2-1 highlights the recommended algorithms and key sizes.\"\n    },\n    {\n        \"issueTypeId\": \"SipServer\",\n        \"remediationGuidance\": \"SIP servers are common attack vectors for cyber criminals. To maintain a secure SIP server, a number of security measures should be implemented.\\n1: Assess whether the SIP server must be accessible on the public facing internet. If the server must be publicly accessible, require the use of a secure VPN.\\n2: Limit access to the SIP server to trusted sources by implementing an IP Access Control List.\\n3: Enable digest authentication. This will require users to authenticate with a username and password. Ensure chosen passwords are strong and that lockout policies are used.\\n4: Use TLS to ensure that information being sent to and from the server is encrypted.\"\n    },\n    {\n        \"issueTypeId\": \"SmbServer\",\n        \"remediationGuidance\": \"Due to the large number of cyber-attacks targeting SMB, Xpanse recommends that organizations implement the following best practices:\\n\\n**1: Update to the most recent SMB version** to reduce the attack surface area and apply patches promptly. It’s imperative to disable SMBv1 whenever possible, as it does not support encryption and has significant security vulnerabilities. If an organization cannot immediately transition off SMBv1, it is recommended that systems using this protocol should not be publicly accessible and should have strict access control policies.\\n**2: Secure the network perimeter** by blocking connections to all versions of SMB for TCP ports 445 and 139 and UDP ports 137 and 138.\\n**3: Enable encryption for SMB.** SMB v3.0 and up offer end-to-end encryption; however, this is not enabled by default. To enable SMB encryption, review the procedures listed in Microsoft’s SMB security recommendations: https://docs.microsoft.com/en-us/windows-server/storage/file-server/smb-security\\n**4: Harden SMB authentication** by requiring unique and complex passwords\\n**5: Restrict SMB traffic** between internal assets to prevent the exploitation of “hidden” shares.\\n\\nFurther documentation: https://www.cisa.gov/uscert/ncas/current-activity/2017/01/16/SMB-Security-Best-Practices\"\n    },\n    {\n        \"issueTypeId\": \"SnmpServer\",\n        \"remediationGuidance\": \"Simple Network Management Protocol (SNMP) is commonly abused to gain unauthorized access to network devices and as such should not be responding to requests from the public internet.\\n\\n1: Update to the most recent SNMPv3 version to reduce the attack surface area and apply patches promptly. It’s imperative to disable SNMPv1 and SNMPv2 whenever possible, as it does not support encryption and has significant security vulnerabilities. \\n2: Secure the network by blocking outbound SNMP responses on UDP ports 161 and 162.\\n3: It is recommended to combine SNMPv3 with management information base (MIB) allow-listing using SNMP views.\\n4: SNMP security best practices from CISA can be followed https://www.cisa.gov/uscert/ncas/alerts/TA17-156A\"\n    },\n    {\n        \"issueTypeId\": \"SolarWindsOrionPlatform\",\n        \"remediationGuidance\": \"The SolarWinds breach was a multi-part, sophisticated attack that involved the distribution of the SUNBURST backdoor. SUNBURST is a digitally signed malware that was embedded into a SolarWinds plugin, allowing attackers to move laterally within an organization’s network when the backdoor is executed. The impacted versions are 2019.4 HF 5,2020.2 with no patch installed or 2020.2 HF 1. If any of those versions are running, upgrading to 2020.2.1 HF 2 or above is imperative.\\n\\nSince SUNBURST is digitally signed and looks legitimate, assessing the impact of this intrusion could be complex. Follow CISA’s recommended process for remediating malicious activity caused by SUNBURST. Your organization can also investigate potential SUNBURST activity using the https://unit42.paloaltonetworks.com/atoms/solarstorm/\\n\\nFurther documentation:  https://www.cisa.gov/uscert/ncas/current-activity/2021/03/09/guidance-remediating-networks-affected-solarwinds-and-active\"\n    },\n    {\n        \"issueTypeId\": \"SonicWallSonicOS\",\n        \"remediationGuidance\": \"Determine whether this asset should be exposed to the public internet or not.\\nAfterwards, work with the asset owner to remove the asset should it be determined that the asset should not be publicly accessible.\"\n    },\n    {\n        \"issueTypeId\": \"SpinnakerWebServer\",\n        \"remediationGuidance\": \"Spinnaker is a continuous-delivery platform for managing and releasing software that has known vulnerabilities that when exploited could provide access to internal infrastructure.\\n1: Identify all instances of Spinnaker Web Server and leverage a layered security approach including firewalls, encryption, roles, ACLs, and strong authentication practices.\\n2: Security best practices can be followed from Spinnaker https://spinnaker.io/docs/setup/other_config/security/\"\n    },\n    {\n        \"issueTypeId\": \"SslTlsCbcCipher\",\n        \"remediationGuidance\": \"1: The Cipher Block Chaining (CBC) cipher suite found in older versions of SSL and TLS is vulnerable to numerous security vulnerabilities including the BEAST and POODLE attacks.\\n2: Determine which version of SSL and or TLS is being used in the environment and the CBC cipher suite. Where posssible upgrade to a more secure version of TLS that allows for the Authenticated Encryption with Additional Data (AEAD) cipher suite.\\n3: If disabling SSLv3 is not tenable, then it is strongly encouraged to use the TLS_FALLBACK_SCSV signal. This protocol extension must be supported both client-side and server-side to be fully functional. More information can be found at: https://www.kb.cert.org/vuls/id/577193\"\n    },\n    {\n        \"issueTypeId\": \"SynacorZimbraCollaborationSuite\",\n        \"remediationGuidance\": \"1: Evaluate if Zimbra Collaboration Suite by Synacor Plus should be directly accessible from the internet.\\n2: Ensure the management interface is not exposed to the internet.\\n3: Where possible restrict access and ensure multifactor authentication (MFA) is enforced.\\n4: Further mitigation advice can be followed from CISA https://www.cisa.gov/uscert/ncas/alerts/aa22-228a\"\n    },\n    {\n        \"issueTypeId\": \"TeleconferencingAndCollaboration\",\n        \"remediationGuidance\": \"Teleconferencing and collaboration devices provide access to highly sensitive information and are are often targeted by malicious actors. As such, they should be the subject of security hardening.\\n\\n1: Identify the exposed teleconferencing and collaboration devices and evaluate if there is any PII or sensitive information on the appliance to understand the impact.\\n2: Maintain teleconferencing and collaboration systems behind a firewall or through a VPN.\\n3: If your organization\u0026#39;s teleconferencing and collaboration devices need to be exposed to the internet, then using high-entropy passwords, role-based access, encryption, lockout policy, and traffic inspection is recommended.\\n4: Teleconferencing and collaboration devices security best practices from CISA can be followed https://www.cisa.gov/sites/default/files/publications/CISA_Guidance_for_Securing_Video_Conferencing_S508C.pdf.\"\n    },\n    {\n        \"issueTypeId\": \"TelnetServer\",\n        \"remediationGuidance\": \"1: Best practice is to not have Telnet exposed to the internet and where possible replace with Secure Shell (SSH).\\n2: Evaluate if there is any PII or sensitive information on the appliance to understand the impact of Telnet transmitting unencrypted information.\\n3: Evaluate all devices utilizing Telnet and take a risk-based approach around the need for Telnet.\\n4: Where possible replace existing Telnet usage with SSH. If this is not feasible follow recommended guidelines set forth by the manufacturer to mitigate Telnet exposure.\"\n    },\n    {\n        \"issueTypeId\": \"UnclaimedS3Bucket\",\n        \"remediationGuidance\": \"Unclaimed Amazon S3 Buckets lead to subdomain takeover, which often happens when a developer or engineer removes a cloud resource but does not delete the corresponding DNS record.\\n\\n1: DNS records should be reviewed on a regular basis. Stale and unused DNS entries should be identified and removed.\\n2:The practice of reviewing DNS records should be included in the workflow of engineering or development teams whenever a service is discontinued to ensure all associated DNS entries, hostnames, and subdomains are removed.\"\n    },\n    {\n        \"issueTypeId\": \"UnencryptedFtpServer\",\n        \"remediationGuidance\": \"1: Identify the service owner and business purpose\\n2: Evaluate if there is any PII or sensitive information on the server to understand the impact of the FTP Server transmitting unencrypted information.\\n3: Evaluate if this FTP Server needs to be exposed to the public Internet for business purposes.\\n4: If the server does need to be exposed to the public Internet or an internal network, Xpanse recommeds reconfiguring the server to only accept encrypted FTPS connections or decomissioning the FTP Server and switching to a more modern secured and encrypted file transfer technology\\n5: If the server does not need to be exposed, it should be decommissioned and removed from the network.\"\n    },\n    {\n        \"issueTypeId\": \"UnencryptedLogin\",\n        \"remediationGuidance\": \"Insecure login forms make your organization vulnerable to interception attacks. Secure this process by serving login landing pages over HTTPS with HSTS enabled. This will prevent attackers from stealing plain text credentials by sniffing the network or interfering with the page in transit.\\n\\nFurther documentation:\\n * https://developer.mozilla.org/en-US/docs/Web/Security/Insecure_passwords\\n * https://cheatsheetseries.owasp.org/cheatsheets/Transport_Layer_Protection_Cheat_Sheet.html\"\n    },\n    {\n        \"issueTypeId\": \"VMwareCarbonBlackAppControl\",\n        \"remediationGuidance\": \"VMware Carbon Black App Control should not be accessible on the public internet. If breached, it could allow attackers to gain detailed information about an organization\u0026#39;s network. Specific versions of VMware Carbon Black App Control are vulnerable to an authentication bypass, remote code execution and file upload exploits via CVE-2021-21998, CVE-2022-22951 and CVE-2022-22952 respectively. VMware security advisories, including those affecting VMware Carbon Black App Control, can be found https://www.vmware.com/security/advisories.html.\"\n    },\n    {\n        \"issueTypeId\": \"VMwareSpringFramework\",\n        \"remediationGuidance\": \"Specific environments of the Spring Core Framework contain a remote code execution vulnerability, steps to reduce the probability of such attempts include the following:\\n\\n1: Evaluate whether the vulnerability exists on your system. Information on the requirements for exploitation of the vulnerability can be found at https://spring.io/blog/2022/03/31/spring-framework-rce-early-announcement#am-i-impacted.\\n2: Best practice is to update to current versions, as outdated versions may no longer get security updates on a regular basis and are prime targets for attackers. It is recommended to upgrade to the latest version of Spring Framework. Latest updates can be found at https://spring.io/blog/category/releases.\\n3: If incremental updates cannot be achieved, temporary workarounds include: updating Apache Tomcat to 10.0.20, 9.0.62, or 8.5.78; downgrading to java 8, if upgrading the Spring Framework or Apache Tomcat is not possible; as well as disabling binding to certain fields by setting the disallowedFields option. This is explained in more detail at https://spring.io/blog/2022/03/31/spring-framework-rce-early-announcement#suggested-workarounds.\"\n    },\n    {\n        \"issueTypeId\": \"VMwareVCenterAdminPage\",\n        \"remediationGuidance\": \"Identify the owner of the affected asset and determine if there is a legitimate business need to have this service exposed to the internet.\\nIf not, work with the asset owner to remove the device from the internet.\\n\\nIf the device has a legitimate business need to be exposed to the internet, it is best practice to enable Two-Factor Authentication / Single Sign-on.\\nDocumentation for setup can be found here: https://docs.vmware.com/en/VMware-vSphere/6.7/com.vmware.psc.doc/GUID-ACFFCBEC-6C1C-4BF9-9971-04AEE9362AFE.html\\nEnsure document version matches the one displayed in the affected asset\"\n    },\n    {\n        \"issueTypeId\": \"VMwareVRealizeAutomationAppliance\",\n        \"remediationGuidance\": \"Due to the network access provided by VMware vRealize Automation, it is recommended for instances of VMware vRealize Automation to not be accessible to the public Internet unless there is a business need.\\nXpanse recommends working to identify the asset owner and collaborating with them to remove the asset from the internet.\"\n    },\n    {\n        \"issueTypeId\": \"VMwareVRealizeOperations\",\n        \"remediationGuidance\": \"Determine whether this asset should be exposed to the public internet or not.\\nAfterwards, work with the asset owner to restrict access should it be determined that the asset should not be publicly accessible.\"\n    },\n    {\n        \"issueTypeId\": \"VncServer\",\n        \"remediationGuidance\": \"In general, VNC should not be directly exposed to the Internet as it is frequently targeted and exploited by threat actors as an initial access or backdoor vector.\\nThe following should be evaluated and performed:\\n\\n1: Disable or remove the service from the internet.\\n2: Review whether VNC is absolutely necessary and see if tunneling VNC over SSH or a VPN can be utilized instead.\\n3: Use VNC implementations that encrypt the entire VNC session, including password authentication and data transfer.\"\n    },\n    {\n        \"issueTypeId\": \"WatchGuardFirebox\",\n        \"remediationGuidance\": \"If for any reason it is determined that this device should not be publicly exposed to the internet, identify the asset owner and work to restrict access to the device.\"\n    },\n    {\n        \"issueTypeId\": \"WildcardCertificate\",\n        \"remediationGuidance\": \"The use of wildcard certificates carry significant security risks.  It is recommended that each distinct service on a network has their own unique certificate.\\n\\nAdditional guidance: https://www.bleepingcomputer.com/news/security/nsa-warns-of-wildcard-certificate-risks-provides-mitigations/#:~:text\u0026#61;MItigating%20wildcard%20certificate,their%20latest%20version.\"\n    },\n    {\n        \"issueTypeId\": \"WordPressAdminPage\",\n        \"remediationGuidance\": \"WordPress is a frequently targeted content management system. While there are multiple mitigations that organizations can take, the following should be done at a minimum:\\n\\n1: Use a web application firewall to block external access to the WordPress Admin page.\\n2: Password protect the WordPress Admin directory.\\n3: Enable two factor authentication in WordPress.\\n4: Limit the number of login attempts.\\n5: Enforce IP allow-listing to specific IPs.\\n6: Limit dashboard access to certain users.\\n7: In general, keep WordPress updated.\\n\\nhttps://wordpress.org/support/article/hardening-wordpress/\"\n    },\n    {\n        \"issueTypeId\": \"ZohoManageEngineAccessManagerPlus\",\n        \"remediationGuidance\": \"Zoho ManageEngine Access Manager Plus when unpatched and misconfigured poses a serious security risk to any organization as severe vulnerabilities have been recently released including remote code execution (RCE).\\n\\n1: The Zoho ManageEngine Access Manager Plus application should be behind security controls such as a WAF. In addition Xpanse recommends enabling access filtering such as IP allow-listing, essentially implementing ZeroTrust access.\\n\\n2: Ensure monitoring is configured to detect nefarious activities such as data exfiltration, and exploit attempts.\\n\\n3: Zoho ManageEngine Access Manager Plus best practices can be followed at https://manageengine.optrics.com/access-manager-plus.aspx\"\n    },\n    {\n        \"issueTypeId\": \"ZohoManageEngineADSelfServicePlus\",\n        \"remediationGuidance\": \"1: Best practice is to not have Zoho ManageEngine ADSelfService Plus directly accessible from the internet. \\n2: Evaluate if Zoho ManageEngine ADSelfService Plus needs to be exposed to the public internet for business purposes.\\n3: If Zoho ManageEngine ADSelfService Plus does need to be accessible from the internet follow the Admin guide from ManageEngine to ensure it is secured properly. \\n4: If it does not need to be accessible from the internet follow recommendations from ManageEngine. \\n5: ManageEngine Guidance can be found here. https://www.manageengine.com/products/self-service-password/self-service-password-help-docs.html?topMenu\"\n    },\n    {\n        \"issueTypeId\": \"ZohoManageEngineOpManager\",\n        \"remediationGuidance\": \"Determine whether this asset should be exposed to the public internet or not.\\nAfterwards, work with the asset owner to remove the asset should it be determined that the asset should not be publicly accessible.\"\n    },\n    {\n        \"issueTypeId\": \"ZohoManageEnginePAM360\",\n        \"remediationGuidance\": \"Zoho ManageEngine PAM360 should not be accessible on the public internet. Critical vulnerability CVE-2021-44525 affects builds before 5500 and allows for users to bypass authentication. In addition to removing public access, ensure that PAM360 is upgraded to the latest secure version.\"\n    },\n    {\n        \"issueTypeId\": \"ZohoManageEnginePasswordManagerPro\",\n        \"remediationGuidance\": \"Due to the sensitive nature of the data that can be stored within this asset, it is recommended to not have this device be publicly accessible.\\nIf it is found that the flagged asset is mistakenly exposed to the public internet, work to identify the asset owner and restrict the device from being publicly accessible.\\nIf the device needs to be internet facing for a business purpose, it is recommended to put it behind a security device such as a Web Application Firewall (WAF).\"\n    }\n]",
    "id": "RemediationGuidance",
    "itemVersion": "",
    "locked": false,
    "name": "RemediationGuidance",
    "nameLocked": false,
    "packID": "",
    "previousAllRead": true,
    "system": false,
    "truncated": false,
    "type": "plain_text",
    "version": -1,
    "fromVersion": "6.5.0"
}