{
    "name": "Generic Export Indicators Service",
    "id": "EDL",
    "description": "Use this pack to generate a list based on your Threat Intel Library, and export it to ANY other product in your network, such as your firewall, agent or SIEM. This pack is built for ongoing distribution of indicators from XSOAR to other products in the network, by creating an endpoint with a list of indicators that can be pulled by external vendors.",
    "created": "2020-04-14T00:00:00Z",
    "updated": "2023-01-25T16:54:03Z",
    "legacy": true,
    "support": "xsoar",
    "supportDetails": {
        "url": "https://www.paloaltonetworks.com/cortex"
    },
    "eulaLink": "https://github.com/demisto/content/blob/master/LICENSE",
    "author": "Cortex XSOAR",
    "certification": "certified",
    "price": 0,
    "serverMinVersion": "0.0.0",
    "currentVersion": "3.1.16",
    "tags": [
        "TIM"
    ],
    "categories": [
        "Data Enrichment & Threat Intelligence"
    ],
    "contentItems": {
        "automation": [],
        "playbook": [
            {
                "name": "Tag massive and internal IOCs to avoid EDL listing",
                "description": "This playbook tags internal assets and massive IOCs (TLD wildcards and CIDRs) to be avoided by the EDL. The playbook does the following according to indicator type:\n\nCIDRs - If the CIDR prefix is larger than the set max prefix it tags it as a `Massive_CIDR` and also with `skip_edl`.\n\nTLD Wildcards - If a domainglob is a TLD wildcard (for example, *.net) it will be tagged as `TLD_Wildcard` and also with `skip_edl`.\n\nInternal IPs - If an IP is internal and also part of the CIDR configured by the user in the \"Internal Assets\" list it will be checked as `internal` and tagged with `skip_edl`.\n\nInternal Domains - If a domain is a subdomain of the domains configured in the \"Internal Assets\" list it is checked as `internal` and tagged with `skip_edl`."
            },
            {
                "name": "PAN-OS EDL Service Configuration",
                "description": "Deprecated. No available replacement. This single-run playbook enables Cortex XSOAR's built-in External Dynamic List (EDL) as a service for system indicators, and configures PAN-OS EDL Objects and the respective firewall policy rules.\nThe EDLs will continuously update for each indicator that matches the query syntax input in the playbook \n(to validate to which indicators the query applied,  you need to enter the query syntax from the indicator tab at the top of the playbook inputs window as well). \nIf both the IP and URL indicator types exist in the query, it sorts the indicators into two EDLs, IP and URL. If only one indicator type exists in the query, only one EDL is created. \nThe playbook then creates EDL objects directing to the indicator lists and firewall policy rules in PAN-OS. \n- It is recommended to configure a dedicated EDL Service instance for the usage of this playbook.\n- If necessary to edit or update the EDL query after this playbook run, use the panorama-edit-edl command and panorama integration to update the URL containing the indicator query syntax."
            },
            {
                "name": "Block Domain - External Dynamic List",
                "description": "This playbook blocks domains using External Dynamic Link.\nThe playbook adds a tag to the inputs domain indicators. the tagged domains can be publish as External Dynamic list that can be added to blocklist using products like Panorama by Palo Alto Networks.\nFor Panorama - You can block the tagged domains by creating EDL(in Panorama) with the XSOAR EDL Url, and assign it to Anti-Spyware profile under \"DNS Signature Policies\""
            },
            {
                "name": "Modify EDL",
                "description": "Adds indicators to or removes indicators from an external dynamic list (EDL) by adding or removing an indicator tag. The EDL itself is generated by using the Cortex XSOAR Generic Export Indicators Service integration and querying on a tag in the Indicator Query parameter.\n\nIncident fields that control the behavior of this playbook:\n- EDL Action: Whether to add or remove EDL indicators.\n- EDL Indicators List: Input list of indicators to add to or remove from EDL (according to the value of EDL Action).\n- EDL Tag: Tag value in the Generic Export Indicators Service integration instance Indicator Query, which controls which indicators are on the EDL.\n- EDL Indicator Type: (Only relevant if adding to EDL) Type of indicators to add to EDL."
            }
        ],
        "integration": [
            {
                "name": "Generic Export Indicators Service",
                "description": "Use the Generic Export Indicators Service integration to provide an endpoint with a list of indicators as a service for the system indicators.",
                "category": "Data Enrichment & Threat Intelligence",
                "commands": [
                    {
                        "name": "edl-update",
                        "description": "Updates values stored in the EDL (only available On-Demand)."
                    },
                    {
                        "name": "export-indicators-list-update",
                        "description": "Updates values stored in the List (only available On-Demand)."
                    }
                ]
            }
        ],
        "incidentfield": [
            {
                "name": "Generic Export Indicators Service Indicators List",
                "type": "longText",
                "description": "List of IOCs to add to/remove from EDL (according to value of EDL Action). May be newline- or comma-delimited."
            },
            {
                "name": "Generic Export Indicators Service Type",
                "type": "singleSelect",
                "description": "Only relevant if adding to EDL. Type of indicators to add to EDL."
            },
            {
                "name": "Generic Export Indicators Service Tag",
                "type": "shortText",
                "description": "Tag that adds indicators to EDL. Must match tag value used in EDL query in the instance configuration."
            },
            {
                "name": "Generic Export Indicators Service Action",
                "type": "singleSelect",
                "description": "Action to perform on EDL (possible values: Add, Remove)"
            }
        ],
        "incidenttype": [
            {
                "name": "Generic Export Indicators Service Change",
                "playbook": "Modify EDL",
                "closureScript": "",
                "hours": 0,
                "days": 0,
                "weeks": 0
            }
        ],
        "dashboard": [],
        "indicatorfield": [],
        "report": [],
        "reputation": [],
        "layoutscontainer": [
            {
                "name": "EDL Change Layout",
                "description": ""
            }
        ],
        "pre-process-rule": [],
        "job": [],
        "classifier": [],
        "widget": [],
        "genericfield": [],
        "generictype": [],
        "genericmodule": [],
        "genericdefinition": [],
        "list": [],
        "parsingrule": [],
        "modelingrule": [],
        "correlationrule": [],
        "xsiamdashboard": [],
        "xsiamreport": [],
        "('trigger',)": [],
        "('wizard',)": [],
        "xdrctemplate": []
    },
    "useCases": [],
    "keywords": [
        "EDL",
        "pan-os EDL",
        "panos EDL",
        "panos",
        "export-indicators",
        "export"
    ],
    "dependencies": {}
}