{
    "fromDate": "0001-01-01T00:00:00Z",
    "fromDateLicense": "0001-01-01T00:00:00Z",
    "id": "Case Management Implementation Guide",
    "layout": [
        {
            "forceRange": false,
            "h": 12,
            "i": "3cae0280-d01c-11ea-930b-c19e0ac86977",
            "id": "3cae0280-d01c-11ea-930b-c19e0ac86977",
            "w": 12,
            "widget": {
                "category": "utility",
                "commitMessage": "",
                "dataType": "incidents",
                "dateRange": {
                    "fromDate": "0001-01-01T00:00:00Z",
                    "fromDateLicense": "0001-01-01T00:00:00Z",
                    "period": {
                        "by": "",
                        "byFrom": "days",
                        "byTo": "",
                        "field": "",
                        "fromValue": null,
                        "toValue": null
                    },
                    "toDate": "0001-01-01T00:00:00Z"
                },
                "fromServerVersion": "",
                "id": "",
                "isPredefined": false,
                "itemVersion": "",
                "locked": true,
                "modified": "2020-07-16T17:55:04.401228395+03:00",
                "name": "Text Widget",
                "packID": "",
                "params": {
                    "tableColumns": [
                        {
                            "isDefault": true,
                            "key": "id",
                            "position": 0,
                            "width": 110
                        },
                        {
                            "isDefault": true,
                            "key": "name",
                            "position": 2,
                            "width": 300
                        },
                        {
                            "isDefault": true,
                            "key": "type",
                            "position": 3,
                            "width": 200
                        },
                        {
                            "isDefault": true,
                            "key": "severity",
                            "position": 4,
                            "width": 80
                        },
                        {
                            "isDefault": true,
                            "key": "status",
                            "position": 5,
                            "width": 80
                        },
                        {
                            "isDefault": true,
                            "key": "owner",
                            "position": 6,
                            "width": 160
                        },
                        {
                            "isDefault": true,
                            "key": "roles",
                            "position": 7,
                            "width": 160
                        },
                        {
                            "isDefault": true,
                            "key": "playbookId",
                            "position": 8,
                            "width": 150
                        },
                        {
                            "isDefault": true,
                            "key": "occurred",
                            "position": 9,
                            "width": 200
                        },
                        {
                            "isDefault": true,
                            "key": "dueDate",
                            "position": 10,
                            "width": 200
                        }
                    ],
                    "text": "# Case Management Pack Implementation Guide\n\nThis dashboard is a quick primer for using this Case Management Pack.  Whether you're creating Incidents manually in XSOAR, or fetching from a SIEM, this pack provides some helpful content to help with those goals. \n\n## Default Incident Type\n\nThis Pack includes an Incident Type of 'Case', which has optimized layouts for Case Management, including for manual Incident creation.  To use this as a default for XSOAR, navigate to Settings -> Advanced -> Incident Types and select Case and Set as Default.\n\n## Incident Ingestion\n\nSetting Case as the default type means you can enable a fetch from any integration and it will default to this type.  This means no mapping & classification is really required, as data from the incoming incident will be displayed in the labels section.  This means you can quickly bring in alerts from various systems, and then further tune the data, layouts, and playbooks as future improvements.\n\n## Layouts\n\nThe Case type has an optimized layout for both the summary pages, and the new/edit screen.  This layout includes some useful action buttons for Analysts to utilize in their day to day. \n\nThis layout can use used as a template for future Incident types you create in your system, you can copy it (5.5) or use as the default for a Incident type (6.0)\n\n## Playbook\n\nThe default playbook for the Case type is 'Case Management - Generic', this playbook is very simple, but does have a few optional add-ons you might want to enable.  At it's core the playbook simply does the following:\n\n- Extract & Enrich Indicators: Extract IOCs (hashes, ips, urls) from the incoming Incident data, and mark these items as a note.\n- Pause and wait for Analyst review\n\n### Timers\n\nOptionally this playbook has built in Timers for adding metrics for Mean Time to Assignment or Mean Time to Remediation to the metrics you are tracking in the system.  To take advantage of these timers, you can add the included TimersOnOwnerChange script to as a field trigger script on the Owner field.   This script will stop the Time to Assignment timer and start the Remediation SLA timer when an owner is first assigned to the Incident.\n\nTo set this up:\n1. Settings -> Advanced -> Fields\n2. Find and edit the Owner field\n3. Select TimersOnOwnerChange on the 'Script to run when field value changes' option\n\n## Dashboards\n\nThis pack includes 3 dashboards:\n\n- Incident Overview: High level summary of all Incidents in the system, by type, severity, owner, unassigned, etc. \n- My Incidents: Analyst focused dashboard for them to work Incidents assigned to them or Incidents they are participating in.  This dashboard also shows any War Room chats they may have been mentioned in.\n- Case Management Implementation Guide: That's this dashboard, and is intended as a guide for implementing this pack, feel free to delete it once done. \n\n### Optional Widgets\n\nThere are 3 optional widgets you can add to these dashboards, if you've enabled the Timers as noted above:\n\n- Mean Time to Assignment: Shows the average time to assignment for Incidents in the system where the Time to Assignment Timer was used.\n- Mean Time to Remediation (Remediation SLA): Shows the average time to remediation for Incidents where the Remediation SLA Timer was used.\n- My Mean Time to Remediation (Remediation SLA): Shows the average time to remediation for Incidents where the Owner is the viewing user. \n\nYou can add these Timers to existing or a new dashboard from the home screen!  If you're building your own playbooks, you can include these timers to track these metrics on those as well!\n\n## Incident Action Buttons\n\nThis pack includes a pair of useful Incident action button scripts, which are added to the layout included in this pack, but can be added to any other Incident types you create or out of the box types:\n\n- Assign to Me (AssignToMeButton): Assigns an Incident to the user who clicked the button. \n- Link Incidents (LinkIncidents): Allows a user to link or unlink Incidents, also takes a comma separated list of Incidents to link or unlink. \n\n# What Next?\n\nWant to take it to the next level?  The next steps after implementing this pack might include the following:\n\n- Pivot incoming alerts from SIEMs etc to their own Incident types, with their own playbooks to automate away the mundane!\n- Use pre-processing rules to drop or link duplicate alerts!\n- Map data from incoming alerts to fields, allowing search ability, correlation of Incidents between different alert sources (i.e. map a username from different sources to the same field in XSOAR!)\n- Modify the Case layout on new types, replacing the labels section with the data from the incoming Incident that you mapped to fields.  This maintains a consistent look and feel for your Analysts, but places the information they need directly on the Incident.\n\nFin."
                },
                "prevName": "Text Widget",
                "propagationLabels": [
                    "all"
                ],
                "query": "",
                "shouldCommit": false,
                "size": 0,
                "sort": null,
                "sortValues": null,
                "toServerVersion": "",
                "vcShouldIgnore": false,
                "vcShouldKeepItemLegacyProdMachine": false,
                "version": 0,
                "widgetType": "text"
            },
            "x": 0,
            "y": 0
        }
    ],
    "name": "Case Management Implementation Guide",
    "period": {
        "by": "",
        "byFrom": "days",
        "byTo": "",
        "field": "",
        "fromValue": 7,
        "toValue": null
    },
    "toDate": "0001-01-01T00:00:00Z",
    "version": -1,
    "fromVersion": "5.0.0",
    "description": "",
    "isPredefined": true
}