{
    "allRead": true,
    "allReadWrite": true,
    "data": "# Automation Scripts\n\nThis pack contains a number of automation scripts of various types which an be used for overview/training purposes.  \n\nAll automations can be found via the Automations section, search **tags:training** to find them.\n\n\n## Writing Your First Automation\n\nHere is your challenge.  Write an automation that will retrieve the Users name and email from AD AND the Users Manager Name and Email from AD.  Return it all to one output in Context.\n\nYou can reference the **ADGetUserAndManager** automation in this pack, and watch the video that walks you through it! [Writing our first automation](https://youtu.be/FaAnSVY6-9g)\n\n\n## Types of Automations\n\nHere is a breakdwon of the most common types of automations and where we use them.  They can be searched from the Automations menu, by their associated **tag:**\n\n| Type | Tag | Used For | Video | \n| --- | --- | --- | --- | \n| Field Change Scripts | field-change | Can be used to execute actions when a field on an Incident changes, say if Severity is set to Critical, send a notification, or an Owner is assigned, start/stop a Timer. | [Field Change Scripts](https://youtu.be/UgkEVkdP5iY) | \n| SLA Breach Scripts | sla | SLA Breach Scripts can be used to run actions on an SLA Timer breach.  Example being send a notification if an Incident isn't assigned within a certain time | [SLA Breach Scripts](https://youtu.be/QO1rc2VhOmc)|\n| Field Display Scripts | field-display | Can be used to change how a field displays to the user or even what the field displays to the user.| [Field Display Scripts](https://youtu.be/y8IiZqz95Vc)| \n| Dynamic Sections | dynamic-section or dynamic-indicator-section | Can be used to display information on an Incident or Indicator layout, displaying data from Context or from XSOAR lists | [Dynamic Sections](https://youtu.be/j3JRo5bgerU) |\n| Post Processing | post-processing | Post processing scripts execute right before an Incident is closed. You can associate post processing scripts on the Incident Type, and take actions like closing external tickets, sending notifications, or checking for proper closure data. | [Post Processing Scripts](https://youtu.be/jmlO1zikXao)] |\n| Pre Processing Scripts | pre-processing | Pre processing scripts can be used with preprocessing rules for more advanced actions. | LOL | ",
    "id": "XETAutomationOverview",
    "itemVersion": "",
    "locked": false,
    "name": "XETAutomationOverview",
    "nameLocked": false,
    "packID": "",
    "previousAllRead": true,
    "system": false,
    "truncated": false,
    "type": "markdown",
    "version": -1,
    "fromVersion": "6.8.0"
}