{
    "allRead": true,
    "allReadWrite": true,
    "data": "# XSOAR Incident Lifecycle\n\nUnderstanding the [Incident lifecycle](https://xsoar.pan.dev/docs/incidents/incident-xsoar-incident-lifecycle) in Cortex XSOAR is critical to building your own use cases.  \n\n\n## Planning\n___\n\n[Planning](https://xsoar.pan.dev/docs/incidents/incident-xsoar-incident-lifecycle#planning) involves defining the required Incident Types that we require for our use case, prior to bring the alerts/events/etc into XSOAR.\n\nIncident Types control key parts of execution in Cortex XSOAR, and determines the following when created in Cortex XSOAR.\n\nYou can view Incident Types, and their associated settings from **Settings -\u003e Objects Setup -\u003e Incidents -\u003e Types**\n\n| Item | Description | \n| --- | --- | \n| Default Playbook | The default playbook that is associated when an Incident of the type is created within Cortex XSOAR, and whether to run that playbook automatically on creation. |\n| Layout | The layout that will be presented to the Cortex XSOAR User when they navigate to an Incident with this type. | \n| Fields | Fields that are associated with the Incident, and will then be available for the Layout, and for mapping data into.  Fields can be associated with specific Incident Types or associated with all Incident Types. Incident fields can be viewed from **Settings -\u003e Objects Setup -\u003e Incidents -\u003e Fields**| \n| SLAs | SLAs and Risk thresholds specific to the Incident Type |\n| Indicator Extraction | Indicator extraction rules can be set on Incident creation or field change.  Extraction can be configured to extract specific indicators from specific fields (recommended) or to extract indicators from all data on the incoming Incident. | \n| Post Processing Scripts | Determines, upon closure, what post processing automation script to execute for this Incident type before it is closed. |\n\n\n## Classification and Mapping\n___\n\n| What | Why | \n|---|---|\n| Classification | Classification is the process by which incoming alerts/events/etc are routed to specific Incident Types within Cortex XSOAR.  |\n| Mapping | Mapping is the process of mapping key data points from this incoming alerts/etcs/etc to Incident fields.  Reasons for doing so include:  \u003cul\u003e\u003cli\u003eEnabling fine grained control of Indicator extraction via the Incident Type\u003c/li\u003e\u003cli\u003eEase of use from within Playbook Tasks\u003c/li\u003e\u003cli\u003elacing key and important information on the layout for review by Security Analysts\u003c/li\u003e\u003c/ul\u003e |\n\n\n## Preprocessing\n___\n\n**Before** an Incident is created in Cortex XSOAR it can be evaluated by pre-processing rules to perform actions such linking the new Incident to existing Incidents or dropping the incoming Incident based on certain conditions.  \n\n## Incident Created\n___\n\nAt this point in the lifecycle an Incident is created within Cortex XSOAR. The Incident is created as per the configuration for the classified Incident Type, and a playbook is executed against the Incident if so configured.  \n\nUsers would interact with the Incident via the associated Layout, and drive the Incident towards closure through the playbook, or manual actions taken by the Analyst.\n\n\n## Post Processing\n___\n\nPost-processing happens right before an Incident is closed, and involes executing the post processing automation script associoted with the Incident type (if there is one).\n\nFor example, send an email to the person who opened the incident informing them that their incident has been resolved, or close an incident in a ticketing system.\n\n\n## Fin.\n___\n\nAnd that's it, that's the lifecycle every Incident follows within Cortex XSOAR.  If you understand that, you're well on your way to developing use cases that utilize it!",
    "id": "XETIncidentLifeCycle",
    "itemVersion": "",
    "locked": false,
    "name": "XETIncidentLifeCycle",
    "nameLocked": false,
    "packID": "",
    "previousAllRead": true,
    "system": false,
    "truncated": false,
    "type": "markdown",
    "version": -1,
    "fromVersion": "6.8.0"
}