{
    "name": "Proactive Threat Hunting",
    "description": "The \"Proactive Threat Hunting\" pack for XSOAR enables users to initiate threat hunting sessions with the primary goal of identifying undetected threats within their environment. This pack supports two distinct hunting methods:\n\t\tSDO Hunting: Users can build hypotheses around specific STIX Data Object (SDO) indicators such as Campaigns, Intrusion Sets, or Malware. The pack allows for the search of Indicators of Compromise (IOCs) related to the selected SDO indicator, as well as the identification of tools and tactics used in the corresponding attack pattern.\n\t\tFreestyle Hunt: This method empowers threat hunters to execute custom queries, upload their own IOCs, and conduct comprehensive searches and data enrichment on entities within the environment.\nAdditionally, both hunting methods in the pack offer the capability to take remediation actions directly from the hunting session layout. This includes the ability to block IOCs, isolate endpoints, block accounts, and quarantine files, providing a holistic approach to threat hunting and response.\nOverall, the \"Proactive Threat Hunting\" pack enhances XSOAR's capabilities by allowing security teams to proactively explore and identify potential threats, providing a powerful toolset to enhance the organization's cybersecurity posture.",
    "support": "xsoar",
    "currentVersion": "1.0.0",
    "author": "Cortex XSOAR",
    "url": "https://www.paloaltonetworks.com/cortex",
    "email": "",
    "categories": [
        "Data Enrichment & Threat Intelligence"
    ],
    "tags": [
        "Threat Hunting"
    ],
    "useCases": [],
    "keywords": [],
    "marketplaces": [
        "xsoar"
    ],
    "dependencies": {
        "CortexXDR": {
            "mandatory": false,
            "display_name": "Cortex XDR by Palo Alto Networks"
        },
        "FiltersAndTransformers": {
            "mandatory": true,
            "display_name": "Filters And Transformers"
        },
        "CommonTypes": {
            "mandatory": true,
            "display_name": "Common Types"
        },
        "CommonPlaybooks": {
            "mandatory": true,
            "display_name": "Common Playbooks"
        },
        "LOLBASFeed": {
            "mandatory": true,
            "display_name": "LOLBAS Feed"
        },
        "MicrosoftDefenderAdvancedThreatProtection": {
            "mandatory": false,
            "display_name": "Microsoft Defender for Endpoint"
        },
        "FeedUnit42v2": {
            "mandatory": false,
            "display_name": "Feed Unit42 v2"
        }
    },
    "displayedImages": [
        "CortexXDR",
        "FiltersAndTransformers",
        "CommonTypes",
        "MicrosoftDefenderAdvancedThreatProtection",
        "LOLBASFeed",
        "CommonPlaybooks",
        "FeedUnit42v2"
    ]
}